/*
 * copyright: (c) RDO-Team, 2009
 * filename : rdo_logic_dptsome.cpp
 * author   : Ћущан ƒмитрий
 * date     : 04.11.09
 * bref     : 
 * indent   : 4T
 */

// =========================================================================== PCH
#include "rdo_lib/rdo_runtime/pch.h"
// ====================================================================== INCLUDES
// ====================================================================== SYNOPSIS
#include "rdo_lib/rdo_runtime/rdo_logic_dptsome.h"
// ===============================================================================
