/******************************************************************************//**
 * @copyright (c) RDO-Team, 2009
 * @file      rdo_array.h
 * @authors   Чирков Михаил
 * @date      14.12.2009
 * @brief     
 * @indent    4T
 *********************************************************************************/

#ifndef _LIB_RUNTIME_ARRAY_H_
#define _LIB_RUNTIME_ARRAY_H_

// *********************************************************************** INCLUDES
// *********************************************************************** SYNOPSIS
#include "rdo_lib/rdo_runtime/rdo_value.h"
#include "rdo_lib/rdo_runtime/rdo_array_def.h"
// ********************************************************************************

#endif // _LIB_RUNTIME_ARRAY_H_
