/******************************************************************************//**
 * @copyright (c) RDO-Team, 2009
 * @file      rdo_model_i.h
 * @author    Урусов Андрей
 * @date      28.07.2009
 * @brief     Интерфейсы IModelStructure и IName
 * @indent    4T
 *********************************************************************************/

#ifndef _LIB_RUNTIME_MODEL_I_H_
#define _LIB_RUNTIME_MODEL_I_H_

// ----------------------------------------------------------------------- INCLUDES
// ----------------------------------------------------------------------- SYNOPSIS
#include "rdo_common/rdointerface.h"
// --------------------------------------------------------------------------------

/******************************************************************************//**
 * @interface IModelStructure
 * @brief     Интерфейс структуры модели, используется для записи стукруры в файл трассировки
 *********************************************************************************/
class IModelStructure
{
public:
	/**
	 * @brief      Записать структу модели в поток
	 * @param[out] stream выходной поток
	 */
	virtual void writeModelStructure(REF(std::ostream) stream) const = 0;
};

/******************************************************************************//**
 * @def     DECLARE_IModelStructure
 * @brief   Макрос для декларации метода структуры модели IModelStructure
 * @details Декларирует метод \a writeModelStructure()
 *********************************************************************************/
#define DECLARE_IModelStructure \
	virtual void writeModelStructure(REF(std::ostream) stream) const;

/******************************************************************************//**
 * @interface IName
 * @brief     Интерфейс имени объекта
 *********************************************************************************/
class IName
{
public:
	/**
	 * @brief  Получить имя объекта
	 * @return имя объекта
	 */
	virtual CREF(tstring) name() const = 0;
};

/******************************************************************************//**
 * @def     DECLARE_IName
 * @brief   Макрос для декларации метода интерфейса IName
 * @details Декларирует метод \a name()
 *********************************************************************************/
#define DECLARE_IName \
	virtual CREF(tstring) name() const;

#endif // _LIB_RUNTIME_MODEL_I_H_
