/******************************************************************************//**
 * @copyright (c) RDO-Team, 2010
 * @file      rdo_event_i.h
 * @authors   Ћущан ƒмитрий
 * @date      23.05.2010
 * @brief     
 * @indent    4T
 *********************************************************************************/

#ifndef _LIB_RUNTIME_EVENT_I_H_
#define _LIB_RUNTIME_EVENT_I_H_

// *********************************************************************** INCLUDES
// *********************************************************************** SYNOPSIS
#include "rdo_common/rdointerface.h"
// ********************************************************************************

class IEvent
{
public:
};
#define DECLARE_IEvent

#endif // _LIB_RUNTIME_EVENT_I_H_
