$Frame fram_1
$Back_picture = <127 127 127> 800 800
Show

text   [10, 5,  50, 25, <127 127 127>, <100 255 0>, 'Время:' ]
text   [60, 5, 150, 25, <127 127 127>, <100 255 0>, Time_now ]


text   [10,40 ,350 ,25 , <127 127 127>, <0 0 0>, 'Станок 1 в состоянии:' ]
text   [350,40 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_1.состояние]
text   [500,40 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_1.положение]
text   [10,57.5 ,350 ,25 , <127 127 127>, <0 0 0>, 'Станок 2 в состоянии:' ]
text   [350,57.5 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_2.состояние]
text   [500,57.5 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_2.положение]
text   [10,75 ,350 ,25 , <127 127 127>, <0 0 0>, 'Станок 3 в состоянии:' ]
text   [350,75 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_3.состояние]
text   [500,75 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_3.положение]

text   [10,100 ,350 ,25 , <127 127 127>, <0 0 0>, 'Тележка_1 в состоянии:' ]
text   [350,100 ,350 ,25 , <127 127 127>, <0 0 0>, Тележка_1.состояние]
text   [500,100 ,350 ,25 , <127 127 127>, <0 0 0>, Тележка_1.положение]

text   [10,117.5 ,350 ,25 , <127 127 127>, <0 0 0>, 'Тележка_2 в состоянии:' ]
text   [350,117.5 ,350 ,25 , <127 127 127>, <0 0 0>, Тележка_2.состояние]
text   [500,117.5 ,350 ,25 , <127 127 127>, <0 0 0>, Тележка_2.положение]

text   [10,142.5 ,350 ,25 , <127 127 127>, <0 0 0>, 'Робот_1 в состоянии:' ]
text   [350,142.5 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_1.состояние]
text   [500,142.5 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_1.положение]

text   [10,160 ,350 ,25 , <127 127 127>, <0 0 0>, 'Робот_2 в состоянии:' ]
text   [350,160 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_2.состояние]
text   [500,160 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_2.положение]

text   [10,177.5 ,350 ,25 , <127 127 127>, <0 0 0>, 'Робот_3 в состоянии:' ]
text   [350,177.5 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_3.состояние]
text   [500,177.5 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_3.положение]

text   [10,202.5 ,350 ,25 , <127 127 127>, <0 0 0>, 'Кол-во детале в 1-м накопителе:' ]
text   [350,202.5 ,350 ,25 , <127 127 127>, <0 0 0>, Накопитель_1.текущее_количество]
text   [10,220 ,350 ,25 , <127 127 127>, <0 0 0>, 'Кол-во детале в 2-м накопителе:' ]
text   [350,220 ,350 ,25 , <127 127 127>, <0 0 0>, Накопитель_2.текущее_количество]
text   [10,237.5 ,350 ,25 , <127 127 127>, <0 0 0>, 'Кол-во детале в 3-м накопителе:' ]
text   [350,237.5 ,350 ,25 , <127 127 127>, <0 0 0>, Накопитель_3.текущее_количество]
text   [10,255 ,350 ,25 , <127 127 127>, <0 0 0>, 'Кол-во детале в 4-м накопителе:' ]
text   [350,255 ,350 ,25 , <127 127 127>, <0 0 0>, Накопитель_4.текущее_количество]

text   [10,300 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 1:' ]
text   [250,300 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_1.положение]
text   [350,300 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_1.состояние]

text   [10,320 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 2:' ]
text   [250,320 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_2.положение]
text   [350,320 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_2.состояние]

text   [10,340 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 3:' ]
text   [250,340 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_3.положение]
text   [350,340 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_3.состояние]

text   [10,360 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 4:' ]
text   [250,360 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_4.положение]
text   [350,360 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_4.состояние]

text   [10,380 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 5:' ]
text   [250,380 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_5.положение]
text   [350,380 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_5.состояние]

text   [10,400 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 6:' ]
text   [250,400 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_6.положение]
text   [350,400 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_6.состояние]

text   [10,420 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 7:' ]
text   [250,420 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_7.положение]
text   [350,420 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_7.состояние]

text   [10,440 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 8:' ]
text   [250,440 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_8.положение]
text   [350,440 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_8.состояние]

text   [10,460 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 9:' ]
text   [250,460 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_9.положение]
text   [350,460 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_9.состояние]

text   [10,480 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 10:' ]
text   [250,480 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_10.положение]
text   [350,480 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_10.состояние]

$End
