$Frame fram_1
$Back_picture = <127 127 127> 800 800
Show

text    [10, 5,  50, 25, <127 127 127>, <100 255 0>, 'Время:' ]
text    [60, 5, 150, 25, <127 127 127>, <100 255 0>, Time_now ]


//-------------------Очередь к первому станку---------------------------------------

rect	[x1, y1, hag*10, h, <127 127 127>, <100 255 0> ]
show_if QSTANOK1.длина_очереди <= 10
rect	[x1 + hag*10 - QSTANOK1.длина_очереди*hag - 1, y1, QSTANOK1.длина_очереди*hag, h, <127 0 127>, <100 255 0>]
show_if QSTANOK1.длина_очереди > 10
rect	[x1, y1, hag*10, h, <127 0 127>, <100 255 0>]

show
line	[x1 + hag*10 - hag, y1 + 1, x1 + hag*10 - hag, y1 + h - 1, <0  0 127>]
line	[x1 + hag*10 - 2*hag, y1 + 1, x1 + hag*10 - 2*hag, y1 + h - 1, <0  0 127>]
line	[x1 + hag*10 - 3*hag, y1 + 1, x1 + hag*10 - 3*hag, y1 + h - 1, <0  0 127>]
line	[x1 + hag*10 - 4*hag, y1 + 1, x1 + hag*10 - 4*hag, y1 + h - 1, <0  0 127>]
line	[x1 + hag*10 - 5*hag, y1 + 1, x1 + hag*10 - 5*hag, y1 + h - 1, <0  0 127>]
line	[x1 + hag*10 - 6*hag, y1 + 1, x1 + hag*10 - 6*hag, y1 + h - 1, <0  0 127>]
line	[x1 + hag*10 - 7*hag, y1 + 1, x1 + hag*10 - 7*hag, y1 + h - 1, <0  0 127>]
line	[x1 + hag*10 - 8*hag, y1 + 1, x1 + hag*10 - 8*hag, y1 + h - 1, <0  0 127>]
line	[x1 + hag*10 - 9*hag, y1 + 1, x1 + hag*10 - 9*hag, y1 + h - 1, <0  0 127>]

text    [ x1 - 20, y1 - 5, 90, 25, <127 127 127>, <100 255 0>, QSTANOK1.длина_очереди ]


//-------------------Очередь ко второму станку---------------------------------------

rect	[x2, y2, hag*10, h, <127 127 127>, <100 255 0> ]
show_if QSTANOK1.длина_очереди <= 10
rect	[x2 + hag*10 - QSTANOK2.длина_очереди*hag - 1, y2, QSTANOK2.длина_очереди*hag, h, <127 0 127>, <100 255 0>]
show_if QSTANOK2.длина_очереди > 10
rect	[x2, y2, hag*10, h, <127 0 127>, <100 255 0>]

show
line	[x2 + hag*10 - hag, y2 + 1, x2 + hag*10 - hag, y2 + h - 1, <0  0 127>]
line	[x2 + hag*10 - 2*hag, y2 + 1, x2 + hag*10 - 2*hag, y2 + h - 1, <0  0 127>]
line	[x2 + hag*10 - 3*hag, y2 + 1, x2 + hag*10 - 3*hag, y2 + h - 1, <0  0 127>]
line	[x2 + hag*10 - 4*hag, y2 + 1, x2 + hag*10 - 4*hag, y2 + h - 1, <0  0 127>]
line	[x2 + hag*10 - 5*hag, y2 + 1, x2 + hag*10 - 5*hag, y2 + h - 1, <0  0 127>]
line	[x2 + hag*10 - 6*hag, y2 + 1, x2 + hag*10 - 6*hag, y2 + h - 1, <0  0 127>]
line	[x2 + hag*10 - 7*hag, y2 + 1, x2 + hag*10 - 7*hag, y2 + h - 1, <0  0 127>]
line	[x2 + hag*10 - 8*hag, y2 + 1, x2 + hag*10 - 8*hag, y2 + h - 1, <0  0 127>]
line	[x2 + hag*10 - 9*hag, y2 + 1, x2 + hag*10 - 9*hag, y2 + h - 1, <0  0 127>]

text    [ x2- 20, y2 - 5, 90, 25, <127 127 127>, <100 255 0>, QSTANOK2.длина_очереди ]

//-------------------Очередь ко роботу на входном накопителе---------------------------------------

rect	[x3, y3, hag*10, h, <127 127 127>, <100 255 0> ]
show_if QROBOT1.длина_очереди <= 10
rect	[x3 + hag*10 - QROBOT1.длина_очереди*hag - 1, y3, QROBOT1.длина_очереди*hag, h, <127 0 127>, <100 255 0>]
show_if QROBOT1.длина_очереди > 10
rect	[x3, y3, hag*10, h, <127 0 127>, <100 255 0>]

show
line	[x3 + hag*10 - hag, y3 + 1, x3 + hag*10 - hag, y3 + h - 1, <0  0 127>]
line	[x3 + hag*10 - 2*hag, y3 + 1, x3 + hag*10 - 2*hag, y3 + h - 1, <0  0 127>]
line	[x3 + hag*10 - 3*hag, y3 + 1, x3 + hag*10 - 3*hag, y3 + h - 1, <0  0 127>]
line	[x3 + hag*10 - 4*hag, y3 + 1, x3 + hag*10 - 4*hag, y3 + h - 1, <0  0 127>]
line	[x3 + hag*10 - 5*hag, y3 + 1, x3 + hag*10 - 5*hag, y3 + h - 1, <0  0 127>]
line	[x3 + hag*10 - 6*hag, y3 + 1, x3 + hag*10 - 6*hag, y3 + h - 1, <0  0 127>]
line	[x3 + hag*10 - 7*hag, y3 + 1, x3 + hag*10 - 7*hag, y3 + h - 1, <0  0 127>]
line	[x3 + hag*10 - 8*hag, y3 + 1, x3 + hag*10 - 8*hag, y3 + h - 1, <0  0 127>]
line	[x3 + hag*10 - 9*hag, y3 + 1, x3 + hag*10 - 9*hag, y3 + h - 1, <0  0 127>]

text    [ x3- 20, y3 - 5, 90, 25, <127 127 127>, <100 255 0>, QROBOT1.длина_очереди ]


//-------------------Очередь к роботу на перемещение ко второму---------------------------------------

rect	[x4, y4, hag*10, h2, <127 127 127>, <100 255 0> ]
show_if QROBOT2.длина_очереди <= 10
rect	[x4 + hag*10 - QROBOT2.длина_очереди*hag - 1, y4, QROBOT2.длина_очереди*hag, h2, <127 0 127>, <100 255 0>]
show_if QROBOT2.длина_очереди > 10
rect	[x4, y4, hag*10, h, <127 0 127>, <100 255 0>]

show
line	[x4 + hag*10 - hag, y4 + 1, x4 + hag*10 - hag, y4 + h2 - 1, <0  0 127>]
line	[x4 + hag*10 - 2*hag, y4 + 1, x4 + hag*10 - 2*hag, y4 + h2 - 1, <0  0 127>]
line	[x4 + hag*10 - 3*hag, y4 + 1, x4 + hag*10 - 3*hag, y4 + h2 - 1, <0  0 127>]
line	[x4 + hag*10 - 4*hag, y4 + 1, x4 + hag*10 - 4*hag, y4 + h2 - 1, <0  0 127>]
line	[x4 + hag*10 - 5*hag, y4 + 1, x4 + hag*10 - 5*hag, y4 + h2 - 1, <0  0 127>]
line	[x4 + hag*10 - 6*hag, y4 + 1, x4 + hag*10 - 6*hag, y4 + h2 - 1, <0  0 127>]
line	[x4 + hag*10 - 7*hag, y4 + 1, x4 + hag*10 - 7*hag, y4 + h2 - 1, <0  0 127>]
line	[x4 + hag*10 - 8*hag, y4 + 1, x4 + hag*10 - 8*hag, y4 + h2 - 1, <0  0 127>]
line	[x4 + hag*10 - 9*hag, y4 + 1, x4 + hag*10 - 9*hag, y4 + h2 - 1, <0  0 127>]

text    [ x4- 20, y4 - 5, 90, 25, <127 127 127>, <100 255 0>, QROBOT2.длина_очереди ]


//-------------------Очередь к роботу на разгрузку второго, и перемещение в накопитель---------------------------------------

rect	[x5, y5, hag*10, h, <127 127 127>, <100 255 0> ]
show_if QROBOT3.длина_очереди <= 10
rect	[x5 + hag*10 - QROBOT3.длина_очереди*hag - 1, y5, QROBOT3.длина_очереди*hag, h, <127 0 127>, <100 255 0>]
show_if QROBOT3.длина_очереди > 10
rect	[x5, y5, hag*10, h, <127 0 127>, <100 255 0>]

show
line	[x5 + hag*10 - hag, y5 + 1, x5 + hag*10 - hag, y5 + h - 1, <0  0 127>]
line	[x5 + hag*10 - 2*hag, y5 + 1, x5 + hag*10 - 2*hag, y5 + h - 1, <0  0 127>]
line	[x5 + hag*10 - 3*hag, y5 + 1, x5 + hag*10 - 3*hag, y5 + h - 1, <0  0 127>]
line	[x5 + hag*10 - 4*hag, y5 + 1, x5 + hag*10 - 4*hag, y5 + h - 1, <0  0 127>]
line	[x5 + hag*10 - 5*hag, y5 + 1, x5 + hag*10 - 5*hag, y5 + h - 1, <0  0 127>]
line	[x5 + hag*10 - 6*hag, y5 + 1, x5 + hag*10 - 6*hag, y5 + h - 1, <0  0 127>]
line	[x5 + hag*10 - 7*hag, y5 + 1, x5 + hag*10 - 7*hag, y5 + h - 1, <0  0 127>]
line	[x5 + hag*10 - 8*hag, y5 + 1, x5 + hag*10 - 8*hag, y5 + h - 1, <0  0 127>]
line	[x5 + hag*10 - 9*hag, y5 + 1, x5 + hag*10 - 9*hag, y5 + h - 1, <0  0 127>]

text    [ x5- 20, y5 - 5, 90, 25, <127 127 127>, <100 255 0>, QROBOT3.длина_очереди ]
/*
rect	[100, 100, 100, 20, <127 127 127>, <100 255 0> ]

Show_if QROBOT.длина_очереди = 1
ellipse [ 180, 100, 20, 20,  <127 0 127>, <100 255 0> ]
Show_if QROBOT.длина_очереди = 2
ellipse [ 180, 100, 20, 20,  <127 0 127>, <100 255 0> ]
ellipse [ 160, 100, 20, 20,  <127 0 127>, <100 255 0> ]
Show_if QROBOT.длина_очереди = 3
ellipse [ 180, 100, 20, 20,  <127 127 127>, <100 255 0> ]
ellipse [ 160, 100, 20, 20,  <127 127 127>, <100 255 0> ]
ellipse [ 140, 100, 20, 20,  <127 127 127>, <100 255 0> ]
Show_if QROBOT.длина_очереди = 4
ellipse [ 180, 100, 20, 20,  <127 127 127>, <100 255 0> ]
ellipse [ 160, 100, 20, 20,  <127 127 127>, <100 255 0> ]
ellipse [ 140, 100, 20, 20,  <127 127 127>, <100 255 0> ]
ellipse [ 120, 100, 20, 20,  <127 127 127>, <100 255 0> ]
Show_if QROBOT.длина_очереди > 5
ellipse [ 180, 100, 20, 20,  <127 127 127>, <100 255 0> ]
ellipse [ 160, 100, 20, 20,  <127 127 127>, <100 255 0> ]
ellipse [ 140, 100, 20, 20,  <127 127 127>, <100 255 0> ]
ellipse [ 120, 100, 20, 20,  <127 127 127>, <100 255 0> ]
ellipse [ 100, 100, 20, 20,  <127 127 127>, <100 255 0> ]
*/

//------------------первый станок-----------------------------------

Show_if STANOK1.Состояние = Свободен

rect	[x_st1, y_st1, gx_st1, gy_st1, <255 255 127>, <200 255 100> ]

Show_if STANOK1.Состояние = Занят

rect	[x_st1, y_st1, gx_st1, gy_st1, <255 127 127>, <200 255 100> ]

//------------------второй станок-----------------------------------

Show_if STANOK2.Состояние = Свободен

rect	[x_st2, y_st2, gx_st2, gy_st2, <255 255 127>, <200 255 100> ]

Show_if STANOK2.Состояние = Занят

rect	[x_st2, y_st2, gx_st2, gy_st2, <255 127 127>, <200 255 100> ]

Show
text    [ 600, 97, 90, 25, <127 127 127>, <100 255 0>, QEXIT.длина_очереди ]

/*
text   [10,70 ,350 ,25 , <127 127 127>, <0 0 0>, 'Станок 1 в состоянии:' ]
text   [350,70 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_1.состояние]
text   [500,70 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_1.положение]
text   [10,85 ,350 ,25 , <127 127 127>, <0 0 0>, 'Станок 2 в состоянии:' ]
text   [350,85 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_2.состояние]
text   [500,85 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_2.положение]
text   [10,100 ,350 ,25 , <127 127 127>, <0 0 0>, 'Станок 3 в состоянии:' ]
text   [350,100 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_3.состояние]
text   [500,100 ,350 ,25 , <127 127 127>, <0 0 0>, Станок_3.положение]

text   [10,120 ,350 ,25 , <127 127 127>, <0 0 0>, 'Тележка_1 в состоянии:' ]
text   [350,120 ,350 ,25 , <127 127 127>, <0 0 0>, Тележка_1.состояние]
text   [500,120 ,350 ,25 , <127 127 127>, <0 0 0>, Тележка_1.положение]

text   [10,135 ,350 ,25 , <127 127 127>, <0 0 0>, 'Тележка_2 в состоянии:' ]
text   [350,135 ,350 ,25 , <127 127 127>, <0 0 0>, Тележка_2.состояние]
text   [500,135 ,350 ,25 , <127 127 127>, <0 0 0>, Тележка_2.положение]

text   [10,150 ,350 ,25 , <127 127 127>, <0 0 0>, 'Робот_1 в состоянии:' ]
text   [350,150 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_1.состояние]
text   [500,150 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_1.положение]

text   [10,165 ,350 ,25 , <127 127 127>, <0 0 0>, 'Робот_2 в состоянии:' ]
text   [350,165 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_2.состояние]
text   [500,165 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_2.положение]

text   [10,180 ,350 ,25 , <127 127 127>, <0 0 0>, 'Робот_3 в состоянии:' ]
text   [350,180 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_3.состояние]
text   [500,180 ,350 ,25 , <127 127 127>, <0 0 0>, Робот_3.положение]

text   [10,200 ,350 ,25 , <127 127 127>, <0 0 0>, 'Кол-во детале в 1-м накопителе:' ]
text   [350,200 ,350 ,25 , <127 127 127>, <0 0 0>, Накопитель_1.текущее_количество]
text   [10,215 ,350 ,25 , <127 127 127>, <0 0 0>, 'Кол-во детале в 2-м накопителе:' ]
text   [350,215 ,350 ,25 , <127 127 127>, <0 0 0>, Накопитель_2.текущее_количество]

text   [10,300 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 1:' ]
text   [250,300 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_1.положение]
text   [350,300 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_1.состояние]

text   [10,315 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 2:' ]
text   [250,315 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_2.положение]
text   [350,315 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_2.состояние]

text   [10,330 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 3:' ]
text   [250,330 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_3.положение]
text   [350,330 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_3.состояние]

text   [10,345 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 4:' ]
text   [250,345 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_4.положение]
text   [350,345 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_4.состояние]

text   [10,360 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 5:' ]
text   [250,360 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_5.положение]
text   [350,360 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_5.состояние]

text   [10,375 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 6:' ]
text   [250,375 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_6.положение]
text   [350,375 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_6.состояние]

text   [10,390 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 7:' ]
text   [250,390 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_7.положение]
text   [350,390 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_7.состояние]

text   [10,405 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 8:' ]
text   [250,405 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_8.положение]
text   [350,405 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_8.состояние]

text   [10,420 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 9:' ]
text   [250,420 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_9.положение]
text   [350,420 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_9.состояние]

text   [10,435 ,350 ,25 , <127 127 127>, <0 0 0>, 'Деталь 10:' ]
text   [250,435 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_10.положение]
text   [350,435 ,350 ,25 , <127 127 127>, <0 0 0>, Деталь_10.состояние]
*/

$End
