/*
 * copyright: (c) RDO-Team, 2011
 * filename : std_fun.cpp
 * author   : Александ Барс, Урусов Андрей
 * date     : 
 * bref     : 
 * indent   : 4T
 */

// ====================================================================== PCH
#include "rdo_lib/rdo_runtime/pch.h"
// ====================================================================== INCLUDES
#include <math.h>
// ====================================================================== SYNOPSIS
#include "rdo_lib/rdo_runtime/calc/std_fun.h"
#include "rdo_lib/rdo_runtime/rdo_runtime.h"
// ===============================================================================

OPEN_RDO_RUNTIME_NAMESPACE

// ----------------------------------------------------------------------------
// ---------- Стандартные функции языка
// ----------------------------------------------------------------------------

CLOSE_RDO_RUNTIME_NAMESPACE
