/*!
  \copyright (c) RDO-Team, 2011
  \file      rdo.cpp
  \author    Урусов Андрей (rdo@rk9.bmstu.ru)
  \date      11.06.2006
  \brief     Определение интерфейса IBaseOperation
  \indent    4T
*/

// ---------------------------------------------------------------------------- PCH
#include "simulator/runtime/pch.h"
// ----------------------------------------------------------------------- INCLUDES
// ----------------------------------------------------------------------- SYNOPSIS
#include "simulator/runtime/rdo.h"
// --------------------------------------------------------------------------------

#pragma warning(disable : 4786)
