/******************************************************************************//**
 * @copyright (c) RDO-Team, 2011
 * @file      operation_type.inl
 * @author    Лущан Дмитрий
 * @date      26.07.2011
 * @brief     Тип операции: арифметическое или логическое выражение
 * @indent    4T
 *********************************************************************************/

// ----------------------------------------------------------------------- INCLUDES
// ----------------------------------------------------------------------- SYNOPSIS
// --------------------------------------------------------------------------------

OPEN_RDO_RUNTIME_NAMESPACE

// --------------------------------------------------------------------------------
// -------------------- OperatorType
// --------------------------------------------------------------------------------
template <OperatorType::Type>
inline REF(ruint) OperatorType::getCalcCounter()
{
	static ruint s_сounter = 0;
	return s_сounter;
}

CLOSE_RDO_RUNTIME_NAMESPACE
