/*
 * @copyright (c) RDO-Team, 2011
 * @file      std_fun.cpp
 * @authors   Барс Александр, Урусов Андрей
 * @date      
 * @brief     
 * @indent    4T
 */

// **************************************************************************** PCH
#include "rdo_lib/rdo_runtime/pch.h"
// *********************************************************************** INCLUDES
#include <math.h>
// *********************************************************************** SYNOPSIS
#include "rdo_lib/rdo_runtime/calc/std_fun.h"
// ********************************************************************************

OPEN_RDO_RUNTIME_NAMESPACE

// ********************************************************************************
// ******************** Стандартные функции языка
// ********************************************************************************

CLOSE_RDO_RUNTIME_NAMESPACE
