$Frame  Кадр_1
$Back_picture = <255 255 255> fr1111
Show
  text [205, 175, 30, 12, <255 255 0>, <0 0 0>, = Склад_1.текущее_кол_бревен]
  text [205,  95, 30, 12, <255 255 0>, <0 0 0>, = Склад_2.текущее_кол_бревен]
  text [245, 175, 30, 12, <255 255 0>, <0 0 0>, = Склад_3.текущее_кол_бревен]
  text [245,  95, 30, 12, <255 255 0>, <0 0 0>, = Склад_4.текущее_кол_бревен]
  text [290, 175, 30, 12, <255 255 0>, <0 0 0>, = Склад_5.текущее_кол_бревен]
  text [290,  95, 30, 12, <255 255 0>, <0 0 0>, = Склад_6.текущее_кол_бревен]
  text [345, 175, 30, 12, <255 255 0>, <0 0 0>, = Склад_7.текущее_кол_бревен]
  text [345,  95, 30, 12, <255 255 0>, <0 0 0>, = Склад_8.текущее_кол_бревен]
  text [395, 175, 30, 12, <255 255 0>, <0 0 0>, = Склад_9.текущее_кол_бревен]
  text [395,  95, 30, 12, <255 255 0>, <0 0 0>, = Склад_10.текущее_кол_бревен]
  text [460, 175, 30, 12, <255 255 0>, <0 0 0>, = Склад_11.текущее_кол_бревен]
  text [455,  95, 30, 12, <255 255 0>, <0 0 0>, = Склад_12.текущее_кол_бревен]
  text [520, 175, 30, 12, <255 255 0>, <0 0 0>, = Склад_13.текущее_кол_бревен]
  text [515,  95, 30, 12, <255 255 0>, <0 0 0>, = Склад_14.текущее_кол_бревен]
  text [580, 175, 30, 12, <255 255 0>, <0 0 0>, = Склад_15.текущее_кол_бревен]
  text [580,  95, 30, 12, <255 255 0>, <0 0 0>, = Склад_16.текущее_кол_бревен]
  text [650, 175, 30, 12, <255 255 0>, <0 0 0>, = Склад_17.текущее_кол_бревен]
  text [650,  95, 30, 12, <255 255 0>, <0 0 0>, = Склад_18.текущее_кол_бревен]
  text [720, 175, 30, 12, <255 255 0>, <0 0 0>, = Склад_19.текущее_кол_бревен]
  text [720,  95, 30, 12, <255 255 0>, <0 0 0>, = Склад_20.текущее_кол_бревен]
  text [260, 250, 30, 12, <255 255 0>, <0 0 0>, = Склад_21.текущее_кол_бревен]
  text [260,  25, 30, 12, <255 255 0>, <0 0 0>, = Склад_22.текущее_кол_бревен]
  text [350, 250, 30, 12, <255 255 0>, <0 0 0>, = Склад_23.текущее_кол_бревен]
  text [350,  25, 30, 12, <255 255 0>, <0 0 0>, = Склад_24.текущее_кол_бревен]
  text [470, 250, 30, 12, <255 255 0>, <0 0 0>, = Склад_25.текущее_кол_бревен]
  text [470,  25, 30, 12, <255 255 0>, <0 0 0>, = Склад_26.текущее_кол_бревен]
  text [590, 250, 30, 12, <255 255 0>, <0 0 0>, = Склад_27.текущее_кол_бревен]
  text [590,  25, 30, 12, <255 255 0>, <0 0 0>, = Склад_28.текущее_кол_бревен]
  text [ 55,  90, 30, 12, <255 255 0>, <0 0 0>, = Склад_29.текущее_кол_бревен]
  text [ 55, 407, 30, 12, <255 255 0>, <0 0 0>, = Склад_30.текущее_кол_бревен]

  text [740, 480, 20, 11, transparent, <0 0 0>, Транспортер_1.текущее_кол_бревен]
  text [490, 480, 20, 11, transparent, <0 0 0>, Транспортер_2.текущее_кол_бревен]

  text [340, 312, 40, 11, transparent, <0 0 0>, Позиция_измерения_1.длина]
  text [340, 333, 40, 11, transparent, <0 0 0>, Позиция_измерения_1.диаметр_к]

  text [240, 354, 40, 11, transparent, <0 0 0>, Распилочная_машина_1.длина]
  text [240, 400, 40, 11, transparent, <0 0 0>, Распилочная_машина_1.диаметр_н]
  text [240, 420, 40, 11, transparent, <0 0 0>, Распилочная_машина_1.диаметр_к]

  rect [ 20, 455, 190, 50, <255 255 255>, <255 255 255>]
  text [ 21, 457, 180, 20, transparent, <0 0 0>, 'Обработано:  бревен']
  text [ 21, 477, 180, 20, transparent, <0 0 0>, '               пилоблоков']
  text [200, 460, 40, 11, transparent, <0 0 0>, Распилочная_машина_1.бревна_обработаны]
  text [200, 480, 40, 11, transparent, <0 0 0>, Распилочная_машина_1.обработано_пилоблоков]

Show_if Транспортер_1.текущее_кол_бревен > 0
  rect [610, 400,  50, Транспортер_1.текущее_кол_бревен, <164 106 30>, <164 106 30>]
Show_if Транспортер_2.текущее_кол_бревен > 0
  rect [350, 400, 120, Транспортер_2.текущее_кол_бревен, <164 106 30>, <164 106 30>]

Show_if Позиция_измерения_1.состояние==свободен
  rect [315, 351, 8, 27, <0 225 0>, <0 225 0>]
  rect [315, 399, 8, 27, <0 225 0>, <0 225 0>]
Show_if Позиция_измерения_1.состояние==занят
  rect [315, 351, 8, 27, <225 0 0>, <225 0 0>]
  rect [315, 399, 8, 27, <225 0 0>, <225 0 0>]

Show_if Распилочная_машина_1.состояние==занят
  rect [173, 353, 5, 25, <225 0 0>, <225 0 0>]
  rect [173, 399, 5, 25, <225 0 0>, <225 0 0>]
Show_if Распилочная_машина_1.состояние==свободен
  rect [173, 353, 5, 25, <0 225 0>, <0 0 225>]
  rect [173, 399, 5, 25, <0 225 0>, <0 0 225>]

Show_if Бревно_показать_1.длина > 0
  rect [X_поз_Ф1(Бревно_показать_1.код_места, Бревно_показать_1.позиция, Бревно_показать_1.счетчик_оборотов),
		  Y_поз_Ф1(Бревно_показать_1.код_места, Бревно_показать_1.позиция, Бревно_показать_1.счетчик_оборотов),
		  ( Бревно_показать_1.длина ) / 10 , 15, <164 106 30>, <164 106 30> ]
Show_if Бревно_показать_2.длина > 0
  rect [X_поз_Ф1(Бревно_показать_2.код_места, Бревно_показать_2.позиция, Бревно_показать_2.счетчик_оборотов),
		  Y_поз_Ф1(Бревно_показать_2.код_места, Бревно_показать_2.позиция, Бревно_показать_2.счетчик_оборотов),
		  ( Бревно_показать_2.длина ) / 10 , 15, <164 106 30>, <164 106 30> ]
Show_if Бревно_показать_3.длина > 0
  rect [X_поз_Ф1(Бревно_показать_3.код_места, Бревно_показать_3.позиция, Бревно_показать_3.счетчик_оборотов),
		  Y_поз_Ф1(Бревно_показать_3.код_места, Бревно_показать_3.позиция, Бревно_показать_3.счетчик_оборотов),
		  ( Бревно_показать_3.длина ) / 10 , 15, <164 106 30>, <164 106 30> ]
Show_if Бревно_показать_4.длина > 0
  rect [X_поз_Ф1(Бревно_показать_4.код_места, Бревно_показать_4.позиция, Бревно_показать_4.счетчик_оборотов),
		  Y_поз_Ф1(Бревно_показать_4.код_места, Бревно_показать_4.позиция, Бревно_показать_4.счетчик_оборотов),
		  ( Бревно_показать_4.длина ) / 10 , 15, <164 106 30>, <164 106 30> ]
Show_if Бревно_показать_5.длина > 0
  rect [X_поз_Ф1(Бревно_показать_5.код_места, Бревно_показать_5.позиция, Бревно_показать_5.счетчик_оборотов),
		  Y_поз_Ф1(Бревно_показать_5.код_места, Бревно_показать_5.позиция, Бревно_показать_5.счетчик_оборотов),
		  ( Бревно_показать_5.длина ) / 10 , 15, <164 106 30>, <164 106 30> ]
Show_if Бревно_показать_6.длина > 0
  rect [X_поз_Ф1(Бревно_показать_6.код_места, Бревно_показать_6.позиция, Бревно_показать_6.счетчик_оборотов),
		  Y_поз_Ф1(Бревно_показать_6.код_места, Бревно_показать_6.позиция, Бревно_показать_6.счетчик_оборотов),
		  ( Бревно_показать_6.длина ) / 10 , 15, <164 106 30>, <164 106 30> ]
Show_if Бревно_показать_7.длина > 0
  rect [X_поз_Ф1(Бревно_показать_7.код_места, Бревно_показать_7.позиция, Бревно_показать_7.счетчик_оборотов),
		  Y_поз_Ф1(Бревно_показать_7.код_места, Бревно_показать_7.позиция, Бревно_показать_7.счетчик_оборотов),
		  ( Бревно_показать_7.длина ) / 10 , 15, <164 106 30>, <164 106 30> ]

Show_if Склад_1.номер_заказа > 0
  text [205, 190,  20, 12, <200 0 0>, <255 255 255>, = Склад_1.номер_заказа]
Show_if Склад_2.номер_заказа > 0
  text [205, 110,  20, 12, <200 0 0>, <255 255 255>, = Склад_2.номер_заказа]
Show_if Склад_3.номер_заказа > 0
  text [245, 190,  20, 12, <200 0 0>, <255 255 255>, = Склад_3.номер_заказа]
Show_if Склад_4.номер_заказа > 0
  text [245, 110,  20, 12, <200 0 0>, <255 255 255>, = Склад_4.номер_заказа]
Show_if Склад_5.номер_заказа > 0
  text [290, 190,  20, 12, <200 0 0>, <255 255 255>, = Склад_5.номер_заказа]
Show_if Склад_6.номер_заказа > 0
  text [290, 110,  20, 12, <200 0 0>, <255 255 255>, = Склад_6.номер_заказа]
Show_if Склад_7.номер_заказа > 0
  text [345, 190,  20, 12, <200 0 0>, <255 255 255>, = Склад_7.номер_заказа]
Show_if Склад_8.номер_заказа > 0
  text [345, 110,  20, 12, <200 0 0>, <255 255 255>, = Склад_8.номер_заказа]
Show_if Склад_9.номер_заказа > 0
  text [395, 190,  20, 12, <200 0 0>, <255 255 255>, = Склад_9.номер_заказа]
Show_if Склад_10.номер_заказа > 0
  text [395, 110,  20, 12, <200 0 0>, <255 255 255>, = Склад_10.номер_заказа]
Show_if Склад_11.номер_заказа > 0
  text [460, 190,  20, 12, <200 0 0>, <255 255 255>, = Склад_11.номер_заказа]
Show_if Склад_12.номер_заказа > 0
  text [455, 110,  20, 12, <200 0 0>, <255 255 255>, = Склад_12.номер_заказа]
Show_if Склад_13.номер_заказа > 0
  text [520, 190,  20, 12, <200 0 0>, <255 255 255>, = Склад_13.номер_заказа]
Show_if Склад_14.номер_заказа > 0
  text [515, 110,  20, 12, <200 0 0>, <255 255 255>, = Склад_14.номер_заказа]
Show_if Склад_15.номер_заказа > 0
  text [580, 190,  20, 12, <200 0 0>, <255 255 255>, = Склад_15.номер_заказа]
Show_if Склад_16.номер_заказа > 0
  text [580, 110,  20, 12, <200 0 0>, <255 255 255>, = Склад_16.номер_заказа]
Show_if Склад_17.номер_заказа > 0
  text [650, 190,  20, 12, <200 0 0>, <255 255 255>, = Склад_17.номер_заказа]
Show_if Склад_18.номер_заказа > 0
  text [650, 110,  20, 12, <200 0 0>, <255 255 255>, = Склад_18.номер_заказа]
Show_if Склад_19.номер_заказа > 0
  text [720, 190,  20, 12, <200 0 0>, <255 255 255>, = Склад_19.номер_заказа]
Show_if Склад_20.номер_заказа > 0
  text [720, 110,  20, 12, <200 0 0>, <255 255 255>, = Склад_20.номер_заказа]
Show_if Склад_21.номер_заказа > 0
  text [260, 265,  20, 12, <200 0 0>, <255 255 255>, = Склад_21.номер_заказа]
Show_if Склад_22.номер_заказа > 0
  text [260,  50,  20, 12, <200 0 0>, <255 255 255>, = Склад_22.номер_заказа]
Show_if Склад_23.номер_заказа > 0
  text [350, 265,  20, 12, <200 0 0>, <255 255 255>, = Склад_23.номер_заказа]
Show_if Склад_24.номер_заказа > 0
  text [350,  50,  20, 12, <200 0 0>, <255 255 255>, = Склад_24.номер_заказа]
Show_if Склад_25.номер_заказа > 0
  text [470, 265,  20, 12, <200 0 0>, <255 255 255>, = Склад_25.номер_заказа]
Show_if Склад_26.номер_заказа > 0
  text [470,  50,  20, 12, <200 0 0>, <255 255 255>, = Склад_26.номер_заказа]
Show_if Склад_27.номер_заказа > 0
  text [590, 265,  20, 12, <200 0 0>, <255 255 255>, = Склад_27.номер_заказа]
Show_if Склад_28.номер_заказа > 0
  text [590,  50,  20, 12, <200 0 0>, <255 255 255>, = Склад_28.номер_заказа]
$End

$Frame  Кадр_2
$Back_picture = <127 127 127>  fr3
Show
  text [600,  43, 40, 11, transparent, <0 0 0>, Позиция_измерения_1.длина]
  text [700,  43, 40, 11, transparent, <0 0 0>, Позиция_измерения_1.диаметр_н]
  text [700,  85, 40, 11, transparent, <0 0 0>, Позиция_измерения_1.диаметр_к]

Show_if Позиция_измерения_1.длина > 0
  rect [ 30, 280-Позиция_измерения_1.диаметр_к/20.0,
			Позиция_измерения_1.длина * 0.28, Позиция_измерения_1.диаметр_к/10.0 + 1, <128 128 128>, <128 128 128> ]
  triang [ 30, 280-Позиция_измерения_1.диаметр_н/20.0,
			  30, 280-Позиция_измерения_1.диаметр_к/20.0,
			  30+Позиция_измерения_1.длина * 0.28 - 1, 280-Позиция_измерения_1.диаметр_к/20.0, <128 128 128>, <128 128 128> ]
  triang [ 30, 280+Позиция_измерения_1.диаметр_н/20.0,
			  30, 280+Позиция_измерения_1.диаметр_к/20.0,
			  30+Позиция_измерения_1.длина * 0.28 - 1, 280+Позиция_измерения_1.диаметр_к/20.0, <128 128 128>, <128 128 128> ]

Show_if Распилочная_машина_1.кол_пилоблоков > 0
  line [ 30+Размер_отпил_торца * 0.28, 230, 30+Размер_отпил_торца * 0.28, 330, <0 0 0>]
  rect [ 30+Размер_отпил_торца * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>]
  text [ 30+Размер_отпил_торца * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>, = Размер_отпил_торца]
  text [ Размер_отпил_торца * 0.28, 340, 35, 11, transparent, <0 0 0>, > 'A0']

  rect [ 30+Размер_отпил_торца * 0.28 + 1, 280-Результат_раскроя_1.треб_диам/20.0,
			Результат_раскроя_1.длина * 0.28 - 1, Результат_раскроя_1.треб_диам/10.0 + 1, transparent, <255 0 0>]
  line [ 30+Результат_раскроя_1.накопл_длина * 0.28, 230, 30+Результат_раскроя_1.накопл_длина * 0.28, 330, <0 0 0>]
  rect [ 30+Результат_раскроя_1.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>]
  text [ 30+Результат_раскроя_1.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>, = Результат_раскроя_1.накопл_длина]
  text [ Результат_раскроя_1.накопл_длина * 0.28 - 25, 340, 60, 11, transparent, <0 0 0>, > 'A1']
  text [ Результат_раскроя_1.накопл_длина * 0.28 - 25, 360, 60, 11, transparent, <0 0 0>, > Результат_раскроя_1.длина]
  text [ Результат_раскроя_1.накопл_длина * 0.28 - 25, 380, 60, 11, transparent, <0 0 0>, > Результат_раскроя_1.объем_кубический_м]
  text [ Результат_раскроя_1.накопл_длина * 0.28 - 25, 400, 60, 18, transparent, <0 0 0>, > Результат_раскроя_1.код_склада]

Show_if Распилочная_машина_1.кол_пилоблоков > 0 and Результат_раскроя_1.кол_пилоблоков == 1
  bitmap [ 10+(Размер_отпил_торца + Результат_раскроя_1.длина/2) * 0.28, 200, cut1, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 0 and Результат_раскроя_1.кол_пилоблоков == 2
  bitmap [ 10+(Размер_отпил_торца + Результат_раскроя_1.длина/2) * 0.28, 200, cut2, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 0 and Результат_раскроя_1.кол_пилоблоков == 3
  bitmap [ 10+(Размер_отпил_торца + Результат_раскроя_1.длина/2) * 0.28, 200, cut3, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 0 and Результат_раскроя_1.кол_пилоблоков == 4
  bitmap [ 10+(Размер_отпил_торца + Результат_раскроя_1.длина/2) * 0.28, 200, cut4, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 0 and Результат_раскроя_1.кол_пилоблоков == 6
  bitmap [ 10+(Размер_отпил_торца + Результат_раскроя_1.длина/2) * 0.28, 200, cut6, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 0 and Результат_раскроя_1.кол_пилоблоков == 8
  bitmap [ 10+(Размер_отпил_торца + Результат_раскроя_1.длина/2) * 0.28, 200, cut8, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 0 and Результат_раскроя_1.кол_пилоблоков == 9
  bitmap [ 10+(Размер_отпил_торца + Результат_раскроя_1.длина/2) * 0.28, 200, cut9, cut_m]

Show_if Распилочная_машина_1.кол_пилоблоков > 1
  rect [ 30+Результат_раскроя_1.накопл_длина * 0.28 + 1, 280-Результат_раскроя_2.треб_диам/20.0,
			Результат_раскроя_2.длина * 0.28 - 1, Результат_раскроя_2.треб_диам/10.0 + 1, transparent, <255 0 0>]
  line [ 30+Результат_раскроя_2.накопл_длина * 0.28, 230, 30+Результат_раскроя_2.накопл_длина * 0.28, 330, <0 0 0>]
  rect [ 30+Результат_раскроя_2.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>]
  text [ 30+Результат_раскроя_2.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>, = Результат_раскроя_2.накопл_длина]
  text [ Результат_раскроя_2.накопл_длина * 0.28 - 25, 340, 60, 11, transparent, <0 0 0>, > 'A2']
  text [ Результат_раскроя_2.накопл_длина * 0.28 - 25, 360, 60, 11, transparent, <0 0 0>, > Результат_раскроя_2.длина]
  text [ Результат_раскроя_2.накопл_длина * 0.28 - 25, 380, 60, 11, transparent, <0 0 0>, > Результат_раскроя_2.объем_кубический_м]
  text [ Результат_раскроя_2.накопл_длина * 0.28 - 25, 400, 60, 18, transparent, <0 0 0>, > Результат_раскроя_2.код_склада]

Show_if Распилочная_машина_1.кол_пилоблоков > 1 and Результат_раскроя_2.кол_пилоблоков == 1
  bitmap [ 10+(Результат_раскроя_1.накопл_длина + Результат_раскроя_2.длина/2) * 0.28, 200, cut1, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 1 and Результат_раскроя_2.кол_пилоблоков == 2
  bitmap [ 10+(Результат_раскроя_1.накопл_длина + Результат_раскроя_2.длина/2) * 0.28, 200, cut2, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 1 and Результат_раскроя_2.кол_пилоблоков == 3
  bitmap [ 10+(Результат_раскроя_1.накопл_длина + Результат_раскроя_2.длина/2) * 0.28, 200, cut3, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 1 and Результат_раскроя_2.кол_пилоблоков == 4
  bitmap [ 10+(Результат_раскроя_1.накопл_длина + Результат_раскроя_2.длина/2) * 0.28, 200, cut4, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 1 and Результат_раскроя_2.кол_пилоблоков == 6
  bitmap [ 10+(Результат_раскроя_1.накопл_длина + Результат_раскроя_2.длина/2) * 0.28, 200, cut6, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 1 and Результат_раскроя_2.кол_пилоблоков == 8
  bitmap [ 10+(Результат_раскроя_1.накопл_длина + Результат_раскроя_2.длина/2) * 0.28, 200, cut8, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 1 and Результат_раскроя_2.кол_пилоблоков == 9
  bitmap [ 10+(Результат_раскроя_1.накопл_длина + Результат_раскроя_2.длина/2) * 0.28, 200, cut9, cut_m]

Show_if Распилочная_машина_1.кол_пилоблоков > 2
  rect [ 30+Результат_раскроя_2.накопл_длина * 0.28 + 1, 280-Результат_раскроя_3.треб_диам/20.0,
			Результат_раскроя_3.длина * 0.28 - 1, Результат_раскроя_3.треб_диам/10.0 + 1, transparent, <255 0 0>]
  line [ 30+Результат_раскроя_3.накопл_длина * 0.28, 230, 30+Результат_раскроя_3.накопл_длина * 0.28, 330, <0 0 0>]
  rect [ 30+Результат_раскроя_3.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>]
  text [ 30+Результат_раскроя_3.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>, = Результат_раскроя_3.накопл_длина]
  text [ Результат_раскроя_3.накопл_длина * 0.28 - 25, 340, 60, 11, transparent, <0 0 0>, > 'A3']
  text [ Результат_раскроя_3.накопл_длина * 0.28 - 25, 360, 60, 11, transparent, <0 0 0>, > Результат_раскроя_3.длина]
  text [ Результат_раскроя_3.накопл_длина * 0.28 - 25, 380, 60, 11, transparent, <0 0 0>, > Результат_раскроя_3.объем_кубический_м]
  text [ Результат_раскроя_3.накопл_длина * 0.28 - 25, 400, 60, 18, transparent, <0 0 0>, > Результат_раскроя_3.код_склада]

Show_if Распилочная_машина_1.кол_пилоблоков > 2 and Результат_раскроя_3.кол_пилоблоков == 1
  bitmap [ 10+(Результат_раскроя_2.накопл_длина + Результат_раскроя_3.длина/2) * 0.28, 200, cut1, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 2 and Результат_раскроя_3.кол_пилоблоков == 2
  bitmap [ 10+(Результат_раскроя_2.накопл_длина + Результат_раскроя_3.длина/2) * 0.28, 200, cut2, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 2 and Результат_раскроя_3.кол_пилоблоков == 3
  bitmap [ 10+(Результат_раскроя_2.накопл_длина + Результат_раскроя_3.длина/2) * 0.28, 200, cut3, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 2 and Результат_раскроя_3.кол_пилоблоков == 4
  bitmap [ 10+(Результат_раскроя_2.накопл_длина + Результат_раскроя_3.длина/2) * 0.28, 200, cut4, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 2 and Результат_раскроя_3.кол_пилоблоков == 6
  bitmap [ 10+(Результат_раскроя_2.накопл_длина + Результат_раскроя_3.длина/2) * 0.28, 200, cut6, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 2 and Результат_раскроя_3.кол_пилоблоков == 8
  bitmap [ 10+(Результат_раскроя_2.накопл_длина + Результат_раскроя_3.длина/2) * 0.28, 200, cut8, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 2 and Результат_раскроя_3.кол_пилоблоков == 9
  bitmap [ 10+(Результат_раскроя_2.накопл_длина + Результат_раскроя_3.длина/2) * 0.28, 200, cut9, cut_m]

Show_if Распилочная_машина_1.кол_пилоблоков > 3
  rect [ 30+Результат_раскроя_3.накопл_длина * 0.28 + 1, 280-Результат_раскроя_4.треб_диам/20.0,
			Результат_раскроя_4.длина * 0.28 - 1, Результат_раскроя_4.треб_диам/10.0 + 1, transparent, <255 0 0>]
  line [ 30+Результат_раскроя_4.накопл_длина * 0.28, 230, 30+Результат_раскроя_4.накопл_длина * 0.28, 330, <0 0 0>]
  rect [ 30+Результат_раскроя_4.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>]
  text [ 30+Результат_раскроя_4.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>, = Результат_раскроя_4.накопл_длина]
  text [ Результат_раскроя_4.накопл_длина * 0.28 - 25, 340, 60, 11, transparent, <0 0 0>, > 'A4']
  text [ Результат_раскроя_4.накопл_длина * 0.28 - 25, 360, 60, 11, transparent, <0 0 0>, > Результат_раскроя_4.длина]
  text [ Результат_раскроя_4.накопл_длина * 0.28 - 25, 380, 60, 11, transparent, <0 0 0>, > Результат_раскроя_4.объем_кубический_м]
  text [ Результат_раскроя_4.накопл_длина * 0.28 - 25, 400, 60, 18, transparent, <0 0 0>, > Результат_раскроя_4.код_склада]

Show_if Распилочная_машина_1.кол_пилоблоков > 3 and Результат_раскроя_4.кол_пилоблоков == 1
  bitmap [ 10+(Результат_раскроя_3.накопл_длина + Результат_раскроя_4.длина/2) * 0.28, 200, cut1, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 3 and Результат_раскроя_4.кол_пилоблоков == 2
  bitmap [ 10+(Результат_раскроя_3.накопл_длина + Результат_раскроя_4.длина/2) * 0.28, 200, cut2, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 3 and Результат_раскроя_4.кол_пилоблоков == 3
  bitmap [ 10+(Результат_раскроя_3.накопл_длина + Результат_раскроя_4.длина/2) * 0.28, 200, cut3, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 3 and Результат_раскроя_4.кол_пилоблоков == 4
  bitmap [ 10+(Результат_раскроя_3.накопл_длина + Результат_раскроя_4.длина/2) * 0.28, 200, cut4, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 3 and Результат_раскроя_4.кол_пилоблоков == 6
  bitmap [ 10+(Результат_раскроя_3.накопл_длина + Результат_раскроя_4.длина/2) * 0.28, 200, cut6, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 3 and Результат_раскроя_4.кол_пилоблоков == 8
  bitmap [ 10+(Результат_раскроя_3.накопл_длина + Результат_раскроя_4.длина/2) * 0.28, 200, cut8, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 3 and Результат_раскроя_4.кол_пилоблоков == 9
  bitmap [ 10+(Результат_раскроя_3.накопл_длина + Результат_раскроя_4.длина/2) * 0.28, 200, cut9, cut_m]

Show_if Распилочная_машина_1.кол_пилоблоков > 4
  rect [ 30+Результат_раскроя_4.накопл_длина * 0.28 + 1, 280-Результат_раскроя_5.треб_диам/20.0,
			Результат_раскроя_5.длина * 0.28 - 1, Результат_раскроя_5.треб_диам/10.0 + 1, transparent, <255 0 0>]
  line [ 30+Результат_раскроя_5.накопл_длина * 0.28, 230, 30+Результат_раскроя_5.накопл_длина * 0.28, 330, <0 0 0>]
  rect [ 30+Результат_раскроя_5.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>]
  text [ 30+Результат_раскроя_5.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>, = Результат_раскроя_5.накопл_длина]
  text [ Результат_раскроя_5.накопл_длина * 0.28 - 25, 340, 60, 11, transparent, <0 0 0>, > 'A5']
  text [ Результат_раскроя_5.накопл_длина * 0.28 - 25, 360, 60, 11, transparent, <0 0 0>, > Результат_раскроя_5.длина]
  text [ Результат_раскроя_5.накопл_длина * 0.28 - 25, 380, 60, 11, transparent, <0 0 0>, > Результат_раскроя_5.объем_кубический_м]
  text [ Результат_раскроя_5.накопл_длина * 0.28 - 25, 400, 60, 18, transparent, <0 0 0>, > Результат_раскроя_5.код_склада]

Show_if Распилочная_машина_1.кол_пилоблоков > 4 and Результат_раскроя_5.кол_пилоблоков == 1
  bitmap [ 10+(Результат_раскроя_4.накопл_длина + Результат_раскроя_5.длина/2) * 0.28, 200, cut1, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 4 and Результат_раскроя_5.кол_пилоблоков == 2
  bitmap [ 10+(Результат_раскроя_4.накопл_длина + Результат_раскроя_5.длина/2) * 0.28, 200, cut2, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 4 and Результат_раскроя_5.кол_пилоблоков == 3
  bitmap [ 10+(Результат_раскроя_4.накопл_длина + Результат_раскроя_5.длина/2) * 0.28, 200, cut3, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 4 and Результат_раскроя_5.кол_пилоблоков == 4
  bitmap [ 10+(Результат_раскроя_4.накопл_длина + Результат_раскроя_5.длина/2) * 0.28, 200, cut4, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 4 and Результат_раскроя_5.кол_пилоблоков == 6
  bitmap [ 10+(Результат_раскроя_4.накопл_длина + Результат_раскроя_5.длина/2) * 0.28, 200, cut6, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 4 and Результат_раскроя_5.кол_пилоблоков == 8
  bitmap [ 10+(Результат_раскроя_4.накопл_длина + Результат_раскроя_5.длина/2) * 0.28, 200, cut8, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 4 and Результат_раскроя_5.кол_пилоблоков == 9
  bitmap [ 10+(Результат_раскроя_4.накопл_длина + Результат_раскроя_5.длина/2) * 0.28, 200, cut9, cut_m]

Show_if Распилочная_машина_1.кол_пилоблоков > 5
  rect [ 30+Результат_раскроя_5.накопл_длина * 0.28 + 1, 280-Результат_раскроя_6.треб_диам/20.0,
			Результат_раскроя_6.длина * 0.28 - 1, Результат_раскроя_6.треб_диам/10.0 + 1, transparent, <255 0 0>]
  line [ 30+Результат_раскроя_6.накопл_длина * 0.28, 230, 30+Результат_раскроя_6.накопл_длина * 0.28, 330, <0 0 0>]
  rect [ 30+Результат_раскроя_6.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>]
  text [ 30+Результат_раскроя_6.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>, = Результат_раскроя_6.накопл_длина]
  text [ Результат_раскроя_6.накопл_длина * 0.28 - 25, 340, 60, 11, transparent, <0 0 0>, > 'A6']
  text [ Результат_раскроя_6.накопл_длина * 0.28 - 25, 360, 60, 11, transparent, <0 0 0>, > Результат_раскроя_6.длина]
  text [ Результат_раскроя_6.накопл_длина * 0.28 - 25, 380, 60, 11, transparent, <0 0 0>, > Результат_раскроя_6.объем_кубический_м]
  text [ Результат_раскроя_6.накопл_длина * 0.28 - 25, 400, 60, 18, transparent, <0 0 0>, > Результат_раскроя_6.код_склада]

Show_if Распилочная_машина_1.кол_пилоблоков > 5 and Результат_раскроя_6.кол_пилоблоков == 1
  bitmap [ 10+(Результат_раскроя_5.накопл_длина + Результат_раскроя_6.длина/2) * 0.28, 200, cut1, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 5 and Результат_раскроя_6.кол_пилоблоков == 2
  bitmap [ 10+(Результат_раскроя_5.накопл_длина + Результат_раскроя_6.длина/2) * 0.28, 200, cut2, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 5 and Результат_раскроя_6.кол_пилоблоков == 3
  bitmap [ 10+(Результат_раскроя_5.накопл_длина + Результат_раскроя_6.длина/2) * 0.28, 200, cut3, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 5 and Результат_раскроя_6.кол_пилоблоков == 4
  bitmap [ 10+(Результат_раскроя_5.накопл_длина + Результат_раскроя_6.длина/2) * 0.28, 200, cut4, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 5 and Результат_раскроя_6.кол_пилоблоков == 6
  bitmap [ 10+(Результат_раскроя_5.накопл_длина + Результат_раскроя_6.длина/2) * 0.28, 200, cut6, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 5 and Результат_раскроя_6.кол_пилоблоков == 8
  bitmap [ 10+(Результат_раскроя_5.накопл_длина + Результат_раскроя_6.длина/2) * 0.28, 200, cut8, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 5 and Результат_раскроя_6.кол_пилоблоков == 9
  bitmap [ 10+(Результат_раскроя_5.накопл_длина + Результат_раскроя_6.длина/2) * 0.28, 200, cut9, cut_m]

Show_if Распилочная_машина_1.кол_пилоблоков > 6
  rect [ 30+Результат_раскроя_6.накопл_длина * 0.28 + 1, 280-Результат_раскроя_7.треб_диам/20.0,
			Результат_раскроя_7.длина * 0.28 - 1, Результат_раскроя_7.треб_диам/10.0 + 1, transparent, <255 0 0>]
  line [ 30+Результат_раскроя_7.накопл_длина * 0.28, 230, 30+Результат_раскроя_7.накопл_длина * 0.28, 330, <0 0 0>]
  rect [ 30+Результат_раскроя_7.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>]
  text [ 30+Результат_раскроя_7.накопл_длина * 0.28 - 20, 216, 40, 14, transparent, <0 0 0>, = Результат_раскроя_7.накопл_длина]
  text [ Результат_раскроя_7.накопл_длина * 0.28 - 25, 340, 60, 11, transparent, <0 0 0>, > 'A7']
  text [ Результат_раскроя_7.накопл_длина * 0.28 - 25, 360, 60, 11, transparent, <0 0 0>, > Результат_раскроя_7.длина]
  text [ Результат_раскроя_7.накопл_длина * 0.28 - 25, 380, 60, 11, transparent, <0 0 0>, > Результат_раскроя_7.объем_кубический_м]
  text [ Результат_раскроя_7.накопл_длина * 0.28 - 25, 400, 60, 18, transparent, <0 0 0>, > Результат_раскроя_7.код_склада]

Show_if Распилочная_машина_1.кол_пилоблоков > 6 and Результат_раскроя_7.кол_пилоблоков == 1
  bitmap [ 10+(Результат_раскроя_6.накопл_длина + Результат_раскроя_7.длина/2) * 0.28, 200, cut1, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 6 and Результат_раскроя_7.кол_пилоблоков == 2
  bitmap [ 10+(Результат_раскроя_6.накопл_длина + Результат_раскроя_7.длина/2) * 0.28, 200, cut2, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 6 and Результат_раскроя_7.кол_пилоблоков == 3
  bitmap [ 10+(Результат_раскроя_6.накопл_длина + Результат_раскроя_7.длина/2) * 0.28, 200, cut3, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 6 and Результат_раскроя_7.кол_пилоблоков == 4
  bitmap [ 10+(Результат_раскроя_6.накопл_длина + Результат_раскроя_7.длина/2) * 0.28, 200, cut4, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 6 and Результат_раскроя_7.кол_пилоблоков == 6
  bitmap [ 10+(Результат_раскроя_6.накопл_длина + Результат_раскроя_7.длина/2) * 0.28, 200, cut6, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 6 and Результат_раскроя_7.кол_пилоблоков == 8
  bitmap [ 10+(Результат_раскроя_6.накопл_длина + Результат_раскроя_7.длина/2) * 0.28, 200, cut8, cut_m]
Show_if Распилочная_машина_1.кол_пилоблоков > 6 and Результат_раскроя_7.кол_пилоблоков == 9
  bitmap [ 10+(Результат_раскроя_6.накопл_длина + Результат_раскроя_7.длина/2) * 0.28, 200, cut9, cut_m]

$End

$Frame  Кадр_3
$Back_picture = <127 127 127> fr4
Show_if Распилочная_машина_1.кол_пилоблоков > 0 and Распилочная_машина_1.тек_номер_пилоблоков <> 1
  text [ 10, 106,  20, 11, transparent, <0 0 0>, < 'A1']
  text [ 40, 106,  90, 18, transparent, <0 0 0>, < Результат_раскроя_1.имя_клиента]
  text [150, 106,  20, 11, transparent, <0 0 0>, = Результат_раскроя_1.номер_заказа]
  text [177, 106,  30, 11, transparent, <0 0 0>, = Результат_раскроя_1.номер_позиции]
  text [220, 106,  20, 11, transparent, <0 0 0>, = Результат_раскроя_1.качество]
  text [250, 106,  25, 11, transparent, <0 0 0>, = Результат_раскроя_1.класс]
  text [280, 106,  40, 11, transparent, <0 0 0>, < Результат_раскроя_1.длина]
  text [340, 106,  30, 11, transparent, <0 0 0>, < Результат_раскроя_1.ширина]
  text [400, 106,  30, 11, transparent, <0 0 0>, < Результат_раскроя_1.высота]
  text [470, 106,  45, 11, transparent, <0 0 0>, = Результат_раскроя_1.тек_диаметр]
  text [523, 106,  50, 11, transparent, <0 0 0>, = Результат_раскроя_1.треб_диам]
  text [590, 106,  30, 11, transparent, <0 0 0>, = Результат_раскроя_1.кол_пилоблоков]
  text [650, 106,  50, 18, transparent, <0 0 0>, < Результат_раскроя_1.код_склада]
  text [710, 106,  70, 11, transparent, <0 0 0>, < Результат_раскроя_1.объем_кубический_м]

Show_if Распилочная_машина_1.кол_пилоблоков > 0 and Распилочная_машина_1.тек_номер_пилоблоков == 1
  text [ 10, 106,  20, 18, <0 0 222>, <255 255 255>, < 'A1']
  text [ 40, 106,  90, 18,  <0 0 222>, <255 255 255>, < Результат_раскроя_1.имя_клиента]
  text [150, 106,  20, 18,  <0 0 222>, <255 255 255>, = Результат_раскроя_1.номер_заказа]
  text [177, 106,  30, 18,  <0 0 222>, <255 255 255>, = Результат_раскроя_1.номер_позиции]
  text [220, 106,  20, 18,  <0 0 222>, <255 255 255>, = Результат_раскроя_1.качество]
  text [250, 106,  25, 18,  <0 0 222>, <255 255 255>, = Результат_раскроя_1.класс]
  text [280, 106,  40, 18,  <0 0 222>, <255 255 255>, < Результат_раскроя_1.длина]
  text [340, 106,  30, 18,  <0 0 222>, <255 255 255>, < Результат_раскроя_1.ширина]
  text [400, 106,  30, 18,  <0 0 222>, <255 255 255>, < Результат_раскроя_1.высота]
  text [470, 106,  45, 18,  <0 0 222>, <255 255 255>, = Результат_раскроя_1.тек_диаметр]
  text [523, 106,  50, 18,  <0 0 222>, <255 255 255>, = Результат_раскроя_1.треб_диам]
  text [590, 106,  30, 18,  <0 0 222>, <255 255 255>, = Результат_раскроя_1.кол_пилоблоков]
  text [650, 106,  50, 18,  <0 0 222>, <255 255 255>, < Результат_раскроя_1.код_склада]
  text [710, 106,  70, 18,  <0 0 222>, <255 255 255>, < Результат_раскроя_1.объем_кубический_м]

  text [450, 277,  50, 18,  <0 0 222>, <255 255 255>, < Результат_раскроя_1.код_склада]
  text [400, 360,  90, 18,  <0 0 222>, <255 255 255>, < Результат_раскроя_1.использование * 100]
  text [400, 317,  90, 18,  <0 0 222>, <255 255 255>, < Результат_раскроя_1.termin]
  text [600, 320,  90, 18,  <0 0 222>, <255 255 255>, > Результат_раскроя_1.soll]
  text [600, 340,  90, 18,  <0 0 222>, <255 255 255>, > Результат_раскроя_1.lst]
  text [650, 360,  90, 18,  <0 0 222>, <255 255 255>, < Результат_раскроя_1.lst * 100.0 / Результат_раскроя_1.soll]

Show_if Распилочная_машина_1.кол_пилоблоков > 1 and Распилочная_машина_1.тек_номер_пилоблоков <> 2
  text [ 10, 126,  20, 11, transparent, <0 0 0>, < 'A2']
  text [ 40, 126,  90, 18, transparent, <0 0 0>, < Результат_раскроя_2.имя_клиента]
  text [150, 126,  20, 11, transparent, <0 0 0>, = Результат_раскроя_2.номер_заказа]
  text [177, 126,  30, 11, transparent, <0 0 0>, = Результат_раскроя_2.номер_позиции]
  text [220, 126,  20, 11, transparent, <0 0 0>, = Результат_раскроя_2.качество]
  text [250, 126,  25, 11, transparent, <0 0 0>, = Результат_раскроя_2.класс]
  text [280, 126,  40, 11, transparent, <0 0 0>, < Результат_раскроя_2.длина]
  text [340, 126,  30, 11, transparent, <0 0 0>, < Результат_раскроя_2.ширина]
  text [400, 126,  30, 11, transparent, <0 0 0>, < Результат_раскроя_2.высота]
  text [470, 126,  45, 11, transparent, <0 0 0>, = Результат_раскроя_2.тек_диаметр]
  text [523, 126,  50, 11, transparent, <0 0 0>, = Результат_раскроя_2.треб_диам]
  text [590, 126,  30, 11, transparent, <0 0 0>, = Результат_раскроя_2.кол_пилоблоков]
  text [650, 126,  50, 18, transparent, <0 0 0>, < Результат_раскроя_2.код_склада]
  text [710, 126,  70, 11, transparent, <0 0 0>, < Результат_раскроя_2.объем_кубический_м]

Show_if Распилочная_машина_1.кол_пилоблоков > 1 and Распилочная_машина_1.тек_номер_пилоблоков == 2
  text [ 10, 126,  20, 18, <0 0 222>, <255 255 255>, < 'A2']
  text [ 40, 126,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_2.имя_клиента]
  text [150, 126,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_2.номер_заказа]
  text [177, 126,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_2.номер_позиции]
  text [220, 126,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_2.качество]
  text [250, 126,  25, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_2.класс]
  text [280, 126,  40, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_2.длина]
  text [340, 126,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_2.ширина]
  text [400, 126,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_2.высота]
  text [470, 126,  45, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_2.тек_диаметр]
  text [523, 126,  50, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_2.треб_диам]
  text [590, 126,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_2.кол_пилоблоков]
  text [650, 126,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_2.код_склада]
  text [710, 126,  70, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_2.объем_кубический_м]

  text [450, 277,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_2.код_склада]
  text [400, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_2.использование * 100]
  text [400, 317,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_2.termin]
  text [600, 320,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_2.soll]
  text [600, 340,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_2.lst]
  text [650, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_2.lst * 100.0 / Результат_раскроя_2.soll]


Show_if Распилочная_машина_1.кол_пилоблоков > 2 and Распилочная_машина_1.тек_номер_пилоблоков <> 3
  text [ 10, 146,  20, 11, transparent, <0 0 0>, < 'A3']
  text [ 40, 146,  90, 18, transparent, <0 0 0>, < Результат_раскроя_3.имя_клиента]
  text [150, 146,  20, 11, transparent, <0 0 0>, = Результат_раскроя_3.номер_заказа]
  text [177, 146,  30, 11, transparent, <0 0 0>, = Результат_раскроя_3.номер_позиции]
  text [220, 146,  20, 11, transparent, <0 0 0>, = Результат_раскроя_3.качество]
  text [250, 146,  25, 11, transparent, <0 0 0>, = Результат_раскроя_3.класс]
  text [280, 146,  40, 11, transparent, <0 0 0>, < Результат_раскроя_3.длина]
  text [340, 146,  30, 11, transparent, <0 0 0>, < Результат_раскроя_3.ширина]
  text [400, 146,  30, 11, transparent, <0 0 0>, < Результат_раскроя_3.высота]
  text [470, 146,  45, 11, transparent, <0 0 0>, = Результат_раскроя_3.тек_диаметр]
  text [523, 146,  50, 11, transparent, <0 0 0>, = Результат_раскроя_3.треб_диам]
  text [590, 146,  30, 11, transparent, <0 0 0>, = Результат_раскроя_3.кол_пилоблоков]
  text [650, 146,  50, 18, transparent, <0 0 0>, < Результат_раскроя_3.код_склада]
  text [710, 146,  70, 11, transparent, <0 0 0>, < Результат_раскроя_3.объем_кубический_м]

Show_if Распилочная_машина_1.кол_пилоблоков > 2 and Распилочная_машина_1.тек_номер_пилоблоков == 3
  text [ 10, 146,  20, 18, <0 0 222>, <255 255 255>, < 'A3']
  text [ 40, 146,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_3.имя_клиента]
  text [150, 146,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_3.номер_заказа]
  text [177, 146,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_3.номер_позиции]
  text [220, 146,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_3.качество]
  text [250, 146,  25, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_3.класс]
  text [280, 146,  40, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_3.длина]
  text [340, 146,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_3.ширина]
  text [400, 146,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_3.высота]
  text [470, 146,  45, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_3.тек_диаметр]
  text [523, 146,  50, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_3.треб_диам]
  text [590, 146,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_3.кол_пилоблоков]
  text [650, 146,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_3.код_склада]
  text [710, 146,  70, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_3.объем_кубический_м]

  text [450, 277,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_3.код_склада]
  text [400, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_3.использование * 100]
  text [400, 317,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_3.termin]
  text [600, 320,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_3.soll]
  text [600, 340,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_3.lst]
  text [650, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_3.lst * 100.0 / Результат_раскроя_3.soll]

Show_if Распилочная_машина_1.кол_пилоблоков > 3 and Распилочная_машина_1.тек_номер_пилоблоков <> 4
  text [ 10, 166,  20, 11, transparent, <0 0 0>, < 'A4']
  text [ 40, 166,  90, 18, transparent, <0 0 0>, < Результат_раскроя_4.имя_клиента]
  text [150, 166,  20, 11, transparent, <0 0 0>, = Результат_раскроя_4.номер_заказа]
  text [177, 166,  30, 11, transparent, <0 0 0>, = Результат_раскроя_4.номер_позиции]
  text [220, 166,  20, 11, transparent, <0 0 0>, = Результат_раскроя_4.качество]
  text [250, 166,  25, 11, transparent, <0 0 0>, = Результат_раскроя_4.класс]
  text [280, 166,  40, 11, transparent, <0 0 0>, < Результат_раскроя_4.длина]
  text [340, 166,  30, 11, transparent, <0 0 0>, < Результат_раскроя_4.ширина]
  text [400, 166,  30, 11, transparent, <0 0 0>, < Результат_раскроя_4.высота]
  text [470, 166,  45, 11, transparent, <0 0 0>, = Результат_раскроя_4.тек_диаметр]
  text [523, 166,  50, 11, transparent, <0 0 0>, = Результат_раскроя_4.треб_диам]
  text [590, 166,  30, 11, transparent, <0 0 0>, = Результат_раскроя_4.кол_пилоблоков]
  text [650, 166,  50, 18, transparent, <0 0 0>, < Результат_раскроя_4.код_склада]
  text [710, 166,  70, 11, transparent, <0 0 0>, < Результат_раскроя_4.объем_кубический_м]

Show_if Распилочная_машина_1.кол_пилоблоков > 3 and Распилочная_машина_1.тек_номер_пилоблоков == 4
  text [ 10, 166,  20, 18, <0 0 222>, <255 255 255>, < 'A4']
  text [ 40, 166,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_4.имя_клиента]
  text [150, 166,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_4.номер_заказа]
  text [177, 166,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_4.номер_позиции]
  text [220, 166,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_4.качество]
  text [250, 166,  25, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_4.класс]
  text [280, 166,  40, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_4.длина]
  text [340, 166,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_4.ширина]
  text [400, 166,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_4.высота]
  text [470, 166,  45, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_4.тек_диаметр]
  text [523, 166,  50, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_4.треб_диам]
  text [590, 166,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_4.кол_пилоблоков]
  text [650, 166,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_4.код_склада]
  text [710, 166,  70, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_4.объем_кубический_м]

  text [450, 277,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_4.код_склада]
  text [400, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_4.использование * 100]
  text [400, 317,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_4.termin]
  text [600, 320,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_4.soll]
  text [600, 340,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_4.lst]
  text [650, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_4.lst * 100.0 / Результат_раскроя_4.soll]

Show_if Распилочная_машина_1.кол_пилоблоков > 4 and Распилочная_машина_1.тек_номер_пилоблоков <> 5
  text [ 10, 186,  20, 11, transparent, <0 0 0>, < 'A5']
  text [ 40, 186,  90, 18, transparent, <0 0 0>, < Результат_раскроя_5.имя_клиента]
  text [150, 186,  20, 11, transparent, <0 0 0>, = Результат_раскроя_5.номер_заказа]
  text [177, 186,  30, 11, transparent, <0 0 0>, = Результат_раскроя_5.номер_позиции]
  text [220, 186,  20, 11, transparent, <0 0 0>, = Результат_раскроя_5.качество]
  text [250, 186,  25, 11, transparent, <0 0 0>, = Результат_раскроя_5.класс]
  text [280, 186,  40, 11, transparent, <0 0 0>, < Результат_раскроя_5.длина]
  text [340, 186,  30, 11, transparent, <0 0 0>, < Результат_раскроя_5.ширина]
  text [400, 186,  30, 11, transparent, <0 0 0>, < Результат_раскроя_5.высота]
  text [470, 186,  45, 11, transparent, <0 0 0>, = Результат_раскроя_5.тек_диаметр]
  text [523, 186,  50, 11, transparent, <0 0 0>, = Результат_раскроя_5.треб_диам]
  text [590, 186,  30, 11, transparent, <0 0 0>, = Результат_раскроя_5.кол_пилоблоков]
  text [650, 186,  50, 18, transparent, <0 0 0>, < Результат_раскроя_5.код_склада]
  text [710, 186,  70, 11, transparent, <0 0 0>, < Результат_раскроя_5.объем_кубический_м]

Show_if Распилочная_машина_1.кол_пилоблоков > 4 and Распилочная_машина_1.тек_номер_пилоблоков == 5
  text [ 10, 186,  20, 18, <0 0 222>, <255 255 255>, < 'A5']
  text [ 40, 186,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_5.имя_клиента]
  text [150, 186,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_5.номер_заказа]
  text [177, 186,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_5.номер_позиции]
  text [220, 186,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_5.качество]
  text [250, 186,  25, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_5.класс]
  text [280, 186,  40, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_5.длина]
  text [340, 186,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_5.ширина]
  text [400, 186,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_5.высота]
  text [470, 186,  45, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_5.тек_диаметр]
  text [523, 186,  50, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_5.треб_диам]
  text [590, 186,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_5.кол_пилоблоков]
  text [650, 186,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_5.код_склада]
  text [710, 186,  70, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_5.объем_кубический_м]

  text [450, 277,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_5.код_склада]
  text [400, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_5.использование * 100]
  text [400, 317,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_5.termin]
  text [600, 320,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_5.soll]
  text [600, 340,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_5.lst]
  text [650, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_5.lst * 100.0 / Результат_раскроя_5.soll]

Show_if Распилочная_машина_1.кол_пилоблоков > 5 and Распилочная_машина_1.тек_номер_пилоблоков <> 6
  text [ 10, 206,  20, 11, transparent, <0 0 0>, < 'A6']
  text [ 40, 206,  90, 18, transparent, <0 0 0>, < Результат_раскроя_6.имя_клиента]
  text [150, 206,  20, 11, transparent, <0 0 0>, = Результат_раскроя_6.номер_заказа]
  text [177, 206,  30, 11, transparent, <0 0 0>, = Результат_раскроя_6.номер_позиции]
  text [220, 206,  20, 11, transparent, <0 0 0>, = Результат_раскроя_6.качество]
  text [250, 206,  25, 11, transparent, <0 0 0>, = Результат_раскроя_6.класс]
  text [280, 206,  40, 11, transparent, <0 0 0>, < Результат_раскроя_6.длина]
  text [340, 206,  30, 11, transparent, <0 0 0>, < Результат_раскроя_6.ширина]
  text [400, 206,  30, 11, transparent, <0 0 0>, < Результат_раскроя_6.высота]
  text [470, 206,  45, 11, transparent, <0 0 0>, = Результат_раскроя_6.тек_диаметр]
  text [523, 206,  50, 11, transparent, <0 0 0>, = Результат_раскроя_6.треб_диам]
  text [590, 206,  30, 11, transparent, <0 0 0>, = Результат_раскроя_6.кол_пилоблоков]
  text [650, 206,  50, 18, transparent, <0 0 0>, < Результат_раскроя_6.код_склада]
  text [710, 206,  70, 11, transparent, <0 0 0>, < Результат_раскроя_6.объем_кубический_м]

Show_if Распилочная_машина_1.кол_пилоблоков > 5 and Распилочная_машина_1.тек_номер_пилоблоков == 6
  text [ 10, 206,  20, 18, <0 0 222>, <255 255 255>, < 'A6']
  text [ 40, 206,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_6.имя_клиента]
  text [150, 206,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_6.номер_заказа]
  text [177, 206,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_6.номер_позиции]
  text [220, 206,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_6.качество]
  text [250, 206,  25, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_6.класс]
  text [280, 206,  40, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_6.длина]
  text [340, 206,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_6.ширина]
  text [400, 206,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_6.высота]
  text [470, 206,  45, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_6.тек_диаметр]
  text [523, 206,  50, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_6.треб_диам]
  text [590, 206,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_6.кол_пилоблоков]
  text [650, 206,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_6.код_склада]
  text [710, 206,  70, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_6.объем_кубический_м]

  text [450, 277,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_6.код_склада]
  text [400, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_6.использование * 100]
  text [400, 317,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_6.termin]
  text [600, 320,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_6.soll]
  text [600, 340,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_6.lst]
  text [650, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_6.lst * 100.0 / Результат_раскроя_6.soll]

Show_if Распилочная_машина_1.кол_пилоблоков > 6 and Распилочная_машина_1.тек_номер_пилоблоков <> 7
  text [ 10, 226,  20, 11, transparent, <0 0 0>, < 'A7']
  text [ 40, 226,  90, 18, transparent, <0 0 0>, < Результат_раскроя_7.имя_клиента]
  text [150, 226,  20, 11, transparent, <0 0 0>, = Результат_раскроя_7.номер_заказа]
  text [177, 226,  30, 11, transparent, <0 0 0>, = Результат_раскроя_7.номер_позиции]
  text [220, 226,  20, 11, transparent, <0 0 0>, = Результат_раскроя_7.качество]
  text [250, 226,  25, 11, transparent, <0 0 0>, = Результат_раскроя_7.класс]
  text [280, 226,  40, 11, transparent, <0 0 0>, < Результат_раскроя_7.длина]
  text [340, 226,  30, 11, transparent, <0 0 0>, < Результат_раскроя_7.ширина]
  text [400, 226,  30, 11, transparent, <0 0 0>, < Результат_раскроя_7.высота]
  text [470, 226,  45, 11, transparent, <0 0 0>, = Результат_раскроя_7.тек_диаметр]
  text [523, 226,  50, 11, transparent, <0 0 0>, = Результат_раскроя_7.треб_диам]
  text [590, 226,  30, 11, transparent, <0 0 0>, = Результат_раскроя_7.кол_пилоблоков]
  text [650, 226,  50, 18, transparent, <0 0 0>, < Результат_раскроя_7.код_склада]
  text [710, 226,  70, 11, transparent, <0 0 0>, < Результат_раскроя_7.объем_кубический_м]

Show_if Распилочная_машина_1.кол_пилоблоков > 6 and Распилочная_машина_1.тек_номер_пилоблоков == 7
  text [ 10, 226,  20, 18, <0 0 222>, <255 255 255>, < 'A7']
  text [ 40, 226,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_7.имя_клиента]
  text [150, 226,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_7.номер_заказа]
  text [177, 226,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_7.номер_позиции]
  text [220, 226,  20, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_7.качество]
  text [250, 226,  25, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_7.класс]
  text [280, 226,  40, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_7.длина]
  text [340, 226,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_7.ширина]
  text [400, 226,  30, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_7.высота]
  text [470, 226,  45, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_7.тек_диаметр]
  text [523, 226,  50, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_7.треб_диам]
  text [590, 226,  30, 18, <0 0 222>, <255 255 255>, = Результат_раскроя_7.кол_пилоблоков]
  text [650, 226,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_7.код_склада]
  text [710, 226,  70, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_7.объем_кубический_м]

  text [450, 277,  50, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_7.код_склада]
  text [400, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_7.использование * 100]
  text [400, 317,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_7.termin]
  text [600, 320,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_7.soll]
  text [600, 340,  90, 18, <0 0 222>, <255 255 255>, > Результат_раскроя_7.lst]
  text [650, 360,  90, 18, <0 0 222>, <255 255 255>, < Результат_раскроя_7.lst * 100.0 / Результат_раскроя_7.soll]

Show_if Распилочная_машина_1.тек_номер_пилоблоков > 0
  text [270, 280,  30, 11, transparent, <0 0 0>, > Распилочная_машина_1.длина_брутто]
  text [270, 300,  30, 11, transparent, <0 0 0>, > Распилочная_машина_1.длина_нетто]
  text [650, 280,  20, 11, transparent, <0 0 0>, < Распилочная_машина_1.объем_кубический_м_брутто]
  text [650, 300,  20, 11, transparent, <0 0 0>, < Распилочная_машина_1.объем_кубический_м_нетто]
  text [500, 297,  30, 11, transparent, <0 0 0>, < Распилочная_машина_1.объем_кубический_м_нетто / Распилочная_машина_1.объем_кубический_м_брутто * 100]
$End

$Frame  Кадр_4
$Back_picture = <127 127 127> fr5
Show
 text [100, 106,  40, 19, transparent, <0 0 0>, < Заказ_1.склад]
 text [150, 106,  34, 15, transparent, <0 0 0>, > Заказ_1.приоритет]
 text [200, 106,  15, 15, transparent, <0 0 0>, > Заказ_1.качество]
 text [240, 106,  50, 15, transparent, <0 0 0>, < Заказ_1.дата_обслуживания]
 text [337, 106,  30, 15, transparent, <0 0 0>, > Заказ_1.длина]
 text [386, 106,  30, 15, transparent, <0 0 0>, > Заказ_1.ширина]
 text [425, 106,  30, 15, transparent, <0 0 0>, > Заказ_1.высота]
 text [470, 106,  40, 15, transparent, <0 0 0>, = Заказ_1.количество]
 text [590, 106,  30, 15, transparent, <0 0 0>, = Заказ_1.класс]
 text [640, 106,  40, 19, transparent, <0 0 0>, = Заказ_1.вид_древесины]
 text [690, 106,  50, 15, transparent, <0 0 0>, > Заказ_1.объем]

 text [100, 126,  40, 19, transparent, <0 0 0>, < Заказ_2.склад]
 text [150, 126,  34, 15, transparent, <0 0 0>, > Заказ_2.приоритет]
 text [200, 126,  15, 15, transparent, <0 0 0>, > Заказ_2.качество]
 text [240, 126,  50, 15, transparent, <0 0 0>, < Заказ_2.дата_обслуживания]
 text [337, 126,  30, 15, transparent, <0 0 0>, > Заказ_2.длина]
 text [386, 126,  30, 15, transparent, <0 0 0>, > Заказ_2.ширина]
 text [425, 126,  30, 15, transparent, <0 0 0>, > Заказ_2.высота]
 text [470, 126,  40, 15, transparent, <0 0 0>, = Заказ_2.количество]
 text [590, 126,  30, 15, transparent, <0 0 0>, = Заказ_2.класс]
 text [640, 126,  40, 19, transparent, <0 0 0>, = Заказ_2.вид_древесины]
 text [690, 126,  50, 15, transparent, <0 0 0>, > Заказ_2.объем]

 text [100, 146,  40, 19, transparent, <0 0 0>, < Заказ_3.склад]
 text [150, 146,  34, 15, transparent, <0 0 0>, > Заказ_3.приоритет]
 text [200, 146,  15, 15, transparent, <0 0 0>, > Заказ_3.качество]
 text [240, 146,  50, 15, transparent, <0 0 0>, < Заказ_3.дата_обслуживания]
 text [337, 146,  30, 15, transparent, <0 0 0>, > Заказ_3.длина]
 text [386, 146,  30, 15, transparent, <0 0 0>, > Заказ_3.ширина]
 text [425, 146,  30, 15, transparent, <0 0 0>, > Заказ_3.высота]
 text [470, 146,  40, 15, transparent, <0 0 0>, = Заказ_3.количество]
 text [590, 146,  30, 15, transparent, <0 0 0>, = Заказ_3.класс]
 text [640, 146,  40, 19, transparent, <0 0 0>, = Заказ_3.вид_древесины]
 text [690, 146,  50, 15, transparent, <0 0 0>, > Заказ_3.объем]

 text [100, 166,  40, 19, transparent, <0 0 0>, < Заказ_4.склад]
 text [150, 166,  34, 15, transparent, <0 0 0>, > Заказ_4.приоритет]
 text [200, 166,  15, 15, transparent, <0 0 0>, > Заказ_4.качество]
 text [240, 166,  50, 15, transparent, <0 0 0>, < Заказ_4.дата_обслуживания]
 text [337, 166,  30, 15, transparent, <0 0 0>, > Заказ_4.длина]
 text [386, 166,  30, 15, transparent, <0 0 0>, > Заказ_4.ширина]
 text [425, 166,  30, 15, transparent, <0 0 0>, > Заказ_4.высота]
 text [470, 166,  40, 15, transparent, <0 0 0>, = Заказ_4.количество]
 text [590, 166,  30, 15, transparent, <0 0 0>, = Заказ_4.класс]
 text [640, 166,  40, 19, transparent, <0 0 0>, = Заказ_4.вид_древесины]
 text [690, 166,  50, 15, transparent, <0 0 0>, > Заказ_4.объем]

 text [100, 186,  40, 19, transparent, <0 0 0>, < Заказ_5.склад]
 text [150, 186,  34, 15, transparent, <0 0 0>, > Заказ_5.приоритет]
 text [200, 186,  15, 15, transparent, <0 0 0>, > Заказ_5.качество]
 text [240, 186,  50, 15, transparent, <0 0 0>, < Заказ_5.дата_обслуживания]
 text [337, 186,  30, 15, transparent, <0 0 0>, > Заказ_5.длина]
 text [386, 186,  30, 15, transparent, <0 0 0>, > Заказ_5.ширина]
 text [425, 186,  30, 15, transparent, <0 0 0>, > Заказ_5.высота]
 text [470, 186,  40, 15, transparent, <0 0 0>, = Заказ_5.количество]
 text [590, 186,  30, 15, transparent, <0 0 0>, = Заказ_5.класс]
 text [640, 186,  40, 19, transparent, <0 0 0>, = Заказ_5.вид_древесины]
 text [690, 186,  50, 15, transparent, <0 0 0>, > Заказ_5.объем]

 text [100, 206,  40, 19, transparent, <0 0 0>, < Заказ_6.склад]
 text [150, 206,  34, 15, transparent, <0 0 0>, > Заказ_6.приоритет]
 text [200, 206,  15, 15, transparent, <0 0 0>, > Заказ_6.качество]
 text [240, 206,  50, 15, transparent, <0 0 0>, < Заказ_6.дата_обслуживания]
 text [337, 206,  30, 15, transparent, <0 0 0>, > Заказ_6.длина]
 text [386, 206,  30, 15, transparent, <0 0 0>, > Заказ_6.ширина]
 text [425, 206,  30, 15, transparent, <0 0 0>, > Заказ_6.высота]
 text [470, 206,  40, 15, transparent, <0 0 0>, = Заказ_6.количество]
 text [590, 206,  30, 15, transparent, <0 0 0>, = Заказ_6.класс]
 text [640, 206,  40, 19, transparent, <0 0 0>, = Заказ_6.вид_древесины]
 text [690, 206,  50, 15, transparent, <0 0 0>, > Заказ_6.объем]

 text [100, 226,  40, 19, transparent, <0 0 0>, < Заказ_7.склад]
 text [150, 226,  34, 15, transparent, <0 0 0>, > Заказ_7.приоритет]
 text [200, 226,  15, 15, transparent, <0 0 0>, > Заказ_7.качество]
 text [240, 226,  50, 15, transparent, <0 0 0>, < Заказ_7.дата_обслуживания]
 text [337, 226,  30, 15, transparent, <0 0 0>, > Заказ_7.длина]
 text [386, 226,  30, 15, transparent, <0 0 0>, > Заказ_7.ширина]
 text [425, 226,  30, 15, transparent, <0 0 0>, > Заказ_7.высота]
 text [470, 226,  40, 15, transparent, <0 0 0>, = Заказ_7.количество]
 text [590, 226,  30, 15, transparent, <0 0 0>, = Заказ_7.класс]
 text [640, 226,  40, 19, transparent, <0 0 0>, = Заказ_7.вид_древесины]
 text [690, 226,  50, 15, transparent, <0 0 0>, > Заказ_7.объем]

 text [100, 246,  40, 19, transparent, <0 0 0>, < Заказ_8.склад]
 text [150, 246,  34, 15, transparent, <0 0 0>, > Заказ_8.приоритет]
 text [200, 246,  15, 15, transparent, <0 0 0>, > Заказ_8.качество]
 text [240, 246,  50, 15, transparent, <0 0 0>, < Заказ_8.дата_обслуживания]
 text [337, 246,  30, 15, transparent, <0 0 0>, > Заказ_8.длина]
 text [386, 246,  30, 15, transparent, <0 0 0>, > Заказ_8.ширина]
 text [425, 246,  30, 15, transparent, <0 0 0>, > Заказ_8.высота]
 text [470, 246,  40, 15, transparent, <0 0 0>, = Заказ_8.количество]
 text [590, 246,  30, 15, transparent, <0 0 0>, = Заказ_8.класс]
 text [640, 246,  40, 19, transparent, <0 0 0>, = Заказ_8.вид_древесины]
 text [690, 246,  50, 15, transparent, <0 0 0>, > Заказ_8.объем]

 text [100, 266,  40, 19, transparent, <0 0 0>, < Заказ_9.склад]
 text [150, 266,  34, 15, transparent, <0 0 0>, > Заказ_9.приоритет]
 text [200, 266,  15, 15, transparent, <0 0 0>, > Заказ_9.качество]
 text [240, 266,  50, 15, transparent, <0 0 0>, < Заказ_9.дата_обслуживания]
 text [337, 266,  30, 15, transparent, <0 0 0>, > Заказ_9.длина]
 text [386, 266,  30, 15, transparent, <0 0 0>, > Заказ_9.ширина]
 text [425, 266,  30, 15, transparent, <0 0 0>, > Заказ_9.высота]
 text [470, 266,  40, 15, transparent, <0 0 0>, = Заказ_9.количество]
 text [590, 266,  30, 15, transparent, <0 0 0>, = Заказ_9.класс]
 text [640, 266,  40, 19, transparent, <0 0 0>, = Заказ_9.вид_древесины]
 text [690, 266,  50, 15, transparent, <0 0 0>, > Заказ_9.объем]

 text [100, 286,  40, 19, transparent, <0 0 0>, < Заказ_10.склад]
 text [150, 286,  34, 15, transparent, <0 0 0>, > Заказ_10.приоритет]
 text [200, 286,  15, 15, transparent, <0 0 0>, > Заказ_10.качество]
 text [240, 286,  50, 15, transparent, <0 0 0>, < Заказ_10.дата_обслуживания]
 text [337, 286,  30, 15, transparent, <0 0 0>, > Заказ_10.длина]
 text [386, 286,  30, 15, transparent, <0 0 0>, > Заказ_10.ширина]
 text [425, 286,  30, 15, transparent, <0 0 0>, > Заказ_10.высота]
 text [470, 286,  40, 15, transparent, <0 0 0>, = Заказ_10.количество]
 text [590, 286,  30, 15, transparent, <0 0 0>, = Заказ_10.класс]
 text [640, 286,  40, 19, transparent, <0 0 0>, = Заказ_10.вид_древесины]
 text [690, 286,  50, 15, transparent, <0 0 0>, > Заказ_10.объем]

 text [100, 306,  40, 19, transparent, <0 0 0>, < Заказ_11.склад]
 text [150, 306,  34, 15, transparent, <0 0 0>, > Заказ_11.приоритет]
 text [200, 306,  15, 15, transparent, <0 0 0>, > Заказ_11.качество]
 text [240, 306,  50, 15, transparent, <0 0 0>, < Заказ_11.дата_обслуживания]
 text [337, 306,  30, 15, transparent, <0 0 0>, > Заказ_11.длина]
 text [386, 306,  30, 15, transparent, <0 0 0>, > Заказ_11.ширина]
 text [425, 306,  30, 15, transparent, <0 0 0>, > Заказ_11.высота]
 text [470, 306,  40, 15, transparent, <0 0 0>, = Заказ_11.количество]
 text [590, 306,  30, 15, transparent, <0 0 0>, = Заказ_11.класс]
 text [640, 306,  40, 19, transparent, <0 0 0>, = Заказ_11.вид_древесины]
 text [690, 306,  50, 15, transparent, <0 0 0>, > Заказ_11.объем]

 text [100, 326,  40, 19, transparent, <0 0 0>, < Заказ_12.склад]
 text [150, 326,  34, 15, transparent, <0 0 0>, > Заказ_12.приоритет]
 text [200, 326,  15, 15, transparent, <0 0 0>, > Заказ_12.качество]
 text [240, 326,  50, 15, transparent, <0 0 0>, < Заказ_12.дата_обслуживания]
 text [337, 326,  30, 15, transparent, <0 0 0>, > Заказ_12.длина]
 text [386, 326,  30, 15, transparent, <0 0 0>, > Заказ_12.ширина]
 text [425, 326,  30, 15, transparent, <0 0 0>, > Заказ_12.высота]
 text [470, 326,  40, 15, transparent, <0 0 0>, = Заказ_12.количество]
 text [590, 326,  30, 15, transparent, <0 0 0>, = Заказ_12.класс]
 text [640, 326,  40, 19, transparent, <0 0 0>, = Заказ_12.вид_древесины]
 text [690, 326,  50, 15, transparent, <0 0 0>, > Заказ_12.объем]

 text [100, 346,  40, 19, transparent, <0 0 0>, < Заказ_13.склад]
 text [150, 346,  34, 15, transparent, <0 0 0>, > Заказ_13.приоритет]
 text [200, 346,  15, 15, transparent, <0 0 0>, > Заказ_13.качество]
 text [240, 346,  50, 15, transparent, <0 0 0>, < Заказ_13.дата_обслуживания]
 text [337, 346,  30, 15, transparent, <0 0 0>, > Заказ_13.длина]
 text [386, 346,  30, 15, transparent, <0 0 0>, > Заказ_13.ширина]
 text [425, 346,  30, 15, transparent, <0 0 0>, > Заказ_13.высота]
 text [470, 346,  40, 15, transparent, <0 0 0>, = Заказ_13.количество]
 text [590, 346,  30, 15, transparent, <0 0 0>, = Заказ_13.класс]
 text [640, 346,  40, 19, transparent, <0 0 0>, = Заказ_13.вид_древесины]
 text [690, 346,  50, 15, transparent, <0 0 0>, > Заказ_13.объем]

 text [100, 366,  40, 19, transparent, <0 0 0>, < Заказ_14.склад]
 text [150, 366,  34, 15, transparent, <0 0 0>, > Заказ_14.приоритет]
 text [200, 366,  15, 15, transparent, <0 0 0>, > Заказ_14.качество]
 text [240, 366,  50, 15, transparent, <0 0 0>, < Заказ_14.дата_обслуживания]
 text [337, 366,  30, 15, transparent, <0 0 0>, > Заказ_14.длина]
 text [386, 366,  30, 15, transparent, <0 0 0>, > Заказ_14.ширина]
 text [425, 366,  30, 15, transparent, <0 0 0>, > Заказ_14.высота]
 text [470, 366,  40, 15, transparent, <0 0 0>, = Заказ_14.количество]
 text [590, 366,  30, 15, transparent, <0 0 0>, = Заказ_14.класс]
 text [640, 366,  40, 19, transparent, <0 0 0>, = Заказ_14.вид_древесины]
 text [690, 366,  50, 15, transparent, <0 0 0>, > Заказ_14.объем]

 text [100, 386,  40, 19, transparent, <0 0 0>, < Заказ_15.склад]
 text [150, 386,  34, 15, transparent, <0 0 0>, > Заказ_15.приоритет]
 text [200, 386,  15, 15, transparent, <0 0 0>, > Заказ_15.качество]
 text [240, 386,  50, 19, transparent, <0 0 0>, < Заказ_15.дата_обслуживания]
 text [337, 386,  30, 15, transparent, <0 0 0>, > Заказ_15.длина]
 text [386, 386,  30, 15, transparent, <0 0 0>, > Заказ_15.ширина]
 text [425, 386,  30, 15, transparent, <0 0 0>, > Заказ_15.высота]
 text [470, 386,  40, 15, transparent, <0 0 0>, = Заказ_15.количество]
 text [590, 386,  30, 15, transparent, <0 0 0>, = Заказ_15.класс]
 text [640, 386,  40, 19, transparent, <0 0 0>, = Заказ_15.вид_древесины]
 text [690, 386,  50, 15, transparent, <0 0 0>, > Заказ_15.объем]

 text [100, 406,  40, 19, transparent, <0 0 0>, < Заказ_16.склад]
 text [150, 406,  34, 15, transparent, <0 0 0>, > Заказ_16.приоритет]
 text [200, 406,  15, 15, transparent, <0 0 0>, > Заказ_16.качество]
 text [240, 406,  50, 19, transparent, <0 0 0>, < Заказ_16.дата_обслуживания]
 text [337, 406,  30, 15, transparent, <0 0 0>, > Заказ_16.длина]
 text [386, 406,  30, 15, transparent, <0 0 0>, > Заказ_16.ширина]
 text [425, 406,  30, 15, transparent, <0 0 0>, > Заказ_16.высота]
 text [470, 406,  40, 15, transparent, <0 0 0>, = Заказ_16.количество]
 text [590, 406,  30, 15, transparent, <0 0 0>, = Заказ_16.класс]
 text [640, 406,  40, 19, transparent, <0 0 0>, = Заказ_16.вид_древесины]
 text [690, 406,  50, 15, transparent, <0 0 0>, > Заказ_16.объем]


Show_if Заказ_1.кол_готовых == 0 or Заказ_1.кол_готовых <> Заказ_1.количество
 text  [530, 106,  40, 19, transparent, <0 0 0>, = Заказ_1.кол_готовых]
Show_if Заказ_1.кол_готовых <> 0 and Заказ_1.кол_готовых >= Заказ_1.количество
 text  [530, 106,  50, 20,  <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_2.кол_готовых == 0 or Заказ_2.кол_готовых <> Заказ_2.количество
 text  [530, 126,  40, 19, transparent, <0 0 0>, = Заказ_2.кол_готовых]
Show_if Заказ_2.кол_готовых <> 0 and Заказ_2.кол_готовых >= Заказ_2.количество
 text  [530, 126,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_3.кол_готовых == 0 or Заказ_3.кол_готовых <> Заказ_3.количество
 text  [530, 146,  40, 19, transparent, <0 0 0>, = Заказ_3.кол_готовых]
Show_if Заказ_3.кол_готовых <> 0 and Заказ_3.кол_готовых >= Заказ_3.количество
 text  [530, 146,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_4.кол_готовых == 0 or Заказ_4.кол_готовых <> Заказ_4.количество
 text  [530, 166,  40, 19, transparent, <0 0 0>, = Заказ_4.кол_готовых]
Show_if Заказ_4.кол_готовых <> 0 and Заказ_4.кол_готовых >= Заказ_4.количество
 text  [530, 166,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_5.кол_готовых == 0 or Заказ_5.кол_готовых <> Заказ_5.количество
  text [530, 186,  40, 19, transparent, <0 0 0>, = Заказ_5.кол_готовых]
Show_if Заказ_5.кол_готовых <> 0 and Заказ_5.кол_готовых >= Заказ_5.количество
 text  [530, 186,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_6.кол_готовых == 0 or Заказ_6.кол_готовых <> Заказ_6.количество
 text  [530, 206,  40, 19, transparent, <0 0 0>, = Заказ_6.кол_готовых]
Show_if Заказ_6.кол_готовых <> 0 and Заказ_6.кол_готовых >= Заказ_6.количество
 text  [530, 206,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_7.кол_готовых == 0 or Заказ_7.кол_готовых <> Заказ_7.количество
 text  [530, 226,  40, 19, transparent, <0 0 0>, = Заказ_7.кол_готовых]
Show_if Заказ_7.кол_готовых <> 0 and Заказ_7.кол_готовых >= Заказ_7.количество
 text  [530, 226,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_8.кол_готовых == 0 or Заказ_8.кол_готовых <> Заказ_8.количество
 text  [530, 246,  40, 19, transparent, <0 0 0>, = Заказ_8.кол_готовых]
Show_if Заказ_8.кол_готовых <> 0 and Заказ_8.кол_готовых >= Заказ_8.количество
 text  [530, 246,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_9.кол_готовых == 0 or Заказ_9.кол_готовых <> Заказ_9.количество
 text  [530, 266,  40, 19, transparent, <0 0 0>, = Заказ_9.кол_готовых]
Show_if Заказ_9.кол_готовых <> 0 and Заказ_9.кол_готовых >= Заказ_9.количество
 text  [530, 266,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_10.кол_готовых == 0 or Заказ_10.кол_готовых <> Заказ_10.количество
  text [530, 286,  40, 19, transparent, <0 0 0>, = Заказ_10.кол_готовых]
Show_if Заказ_10.кол_готовых <> 0 and Заказ_10.кол_готовых >= Заказ_10.количество
 text  [530, 286,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_11.кол_готовых == 0 or Заказ_11.кол_готовых <> Заказ_11.количество
 text  [530, 306,  40, 19, transparent, <0 0 0>, = Заказ_11.кол_готовых]
Show_if Заказ_11.кол_готовых <> 0 and Заказ_11.кол_готовых >= Заказ_11.количество
 text  [530, 306, 50, 20, <255 0 0>, <255 255 255> , = 'готов']
Show_if Заказ_12.кол_готовых == 0 or Заказ_12.кол_готовых <> Заказ_12.количество
 text  [530, 326,  40, 19, transparent, <0 0 0>, = Заказ_12.кол_готовых]
Show_if Заказ_12.кол_готовых <> 0 and Заказ_12.кол_готовых >= Заказ_12.количество
 text  [530, 326,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_13.кол_готовых == 0 or Заказ_13.кол_готовых <> Заказ_13.количество
  text [530, 346,  40, 19, transparent, <0 0 0>, = Заказ_13.кол_готовых]
Show_if Заказ_13.кол_готовых <> 0 and Заказ_13.кол_готовых >= Заказ_13.количество
text   [530, 346,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_14.кол_готовых == 0 or Заказ_14.кол_готовых <> Заказ_14.количество
 text  [530, 366,  40, 19, transparent, <0 0 0>, = Заказ_14.кол_готовых]
Show_if Заказ_14.кол_готовых <> 0 and Заказ_14.кол_готовых >= Заказ_14.количество
 text  [530, 366, 50, 20, <255 0 0>, <255 255 255> , ='готов']
Show_if Заказ_15.кол_готовых == 0 or Заказ_15.кол_готовых <> Заказ_15.количество
 text  [530, 386,  40, 19, transparent, <0 0 0>, = Заказ_15.кол_готовых]
Show_if Заказ_15.кол_готовых <> 0 and Заказ_15.кол_готовых >= Заказ_15.количество
 text  [530, 386,  50, 20, <255 0 0>, <255 255 255>, = 'готов']
Show_if Заказ_16.кол_готовых == 0 or Заказ_16.кол_готовых <> Заказ_16.количество
 text  [530, 406,  40, 19, transparent, <0 0 0>, = Заказ_16.кол_готовых]
Show_if Заказ_16.кол_готовых <> 0 and Заказ_16.кол_готовых >= Заказ_16.количество
 text  [530, 406,  50, 20, <255 0 0>, <255 255 255>, = 'готов']    
$End    

