/*
 * copyright: (c) RDO-Team, 2010
 * filename : rdobison.h
 * author   : Лущан Дмитрий, Урусов Андрей
 * date     : 
 * bref     : Структура координат токена бизона, дополненная линейной позицией
 * indent   : 4T
 */

#ifndef _CONVERTOR_RDOBISON_H_
#define _CONVERTOR_RDOBISON_H_

// ====================================================================== PCH
// ====================================================================== INCLUDES
// ====================================================================== SYNOPSIS
#include "rdo_lib/rdo_parser/rdobison.h"
// ===============================================================================

#endif //! _CONVERTOR_RDOBISON_H_
