$Frame йцукен
$Back_picture = <0 100 0> 1440 900 
Show

	text     [ 50, 30, 100, 20,
           transparent, <255 255 0>, 'Станок_1' ]
	text     [ 200, 30, 100, 20,
           transparent, <255 255 0>, 'Станок_2' ]
	text     [ 350, 30, 100, 20,
           transparent, <255 255 0>, 'Станок_3' ]
	text     [ 500, 30, 100, 20,
           transparent, <255 255 0>, 'Станок_4' ]
	text     [ 650, 30, 100, 20,
           transparent, <255 255 0>, 'Станок_5' ]
	text     [ 800, 30, 100, 20,
           transparent, <255 255 0>, 'Станок_6' ]
	text     [ 20, 60, 100, 20,
           transparent, <255 255 0>, 'Деталь_' ]		   
	text     [ 80, 60, 100, 20,
           transparent, <255 255 0>, Станок_1.номер_текущей_детали ]
	text     [ 110, 60, 100, 20,
           transparent, <255 255 0>, Станок_1.номер_текущей_операции ]	
	text     [ 30, 90, 100, 20,
           transparent, <255 255 0>, Станок_1.состояние_станка ]	
	text     [ 30, 120, 100, 20,
           transparent, <255 255 0>, time_now ]			   
	text     [ 170, 60, 100, 20,
           transparent, <255 255 0>, 'Деталь_' ]		   
	text     [ 230, 60, 100, 20,
           transparent, <255 255 0>, Станок_2.номер_текущей_детали ]
	text     [ 260, 60, 100, 20,
           transparent, <255 255 0>, Станок_2.номер_текущей_операции ]	
	text     [ 200, 90, 100, 20,
           transparent, <255 255 0>, Станок_2.состояние_станка ]	
	text     [ 180, 120, 100, 20,
           transparent, <255 255 0>, time_now ]	
	text     [ 320, 60, 100, 20,
           transparent, <255 255 0>, 'Деталь_' ]		   
	text     [ 380, 60, 100, 20,
           transparent, <255 255 0>, Станок_3.номер_текущей_детали ]
	text     [ 410, 60, 100, 20,
           transparent, <255 255 0>, Станок_3.номер_текущей_операции ]	
	text     [ 350, 90, 100, 20,
           transparent, <255 255 0>, Станок_3.состояние_станка ]	
	text     [ 330, 120, 100, 20,
           transparent, <255 255 0>, time_now ]	
	text     [ 470, 60, 100, 20,
           transparent, <255 255 0>, 'Деталь_' ]		   
	text     [ 530, 60, 100, 20,
           transparent, <255 255 0>, Станок_4.номер_текущей_детали ]
	text     [ 560, 60, 100, 20,
           transparent, <255 255 0>, Станок_4.номер_текущей_операции ]	
	text     [ 500, 90, 100, 20,
           transparent, <255 255 0>, Станок_4.состояние_станка ]
	text     [ 480, 120, 100, 20,
           transparent, <255 255 0>, time_now ]			   
	text     [ 620, 60, 100, 20,
           transparent, <255 255 0>, 'Деталь_' ]		   
	text     [ 680, 60, 100, 20, 
           transparent, <255 255 0>, Станок_5.номер_текущей_детали ]
	text     [ 710, 60, 100, 20,
           transparent, <255 255 0>, Станок_5.номер_текущей_операции ]	
	text     [ 650, 90, 100, 20,
           transparent, <255 255 0>, Станок_5.состояние_станка ]	 
	text     [ 630, 120, 100, 20,
           transparent, <255 255 0>, time_now ]	
	text     [ 770, 60, 100, 20,
           transparent, <255 255 0>, 'Деталь_' ]		   
	text     [ 830, 60, 100, 20,
           transparent, <255 255 0>, Станок_6.номер_текущей_детали ]
	text     [ 860, 60, 100, 20,
           transparent, <255 255 0>, Станок_6.номер_текущей_операции ]			   
	text     [ 800, 90, 100, 20,
           transparent, <255 255 0>, Станок_6.состояние_станка ]
	text     [ 780, 120, 100, 20,
           transparent, <255 255 0>, time_now ]			   
	rect [ 15, 15, 140, 140,
		   transparent, <255 255 0> ]
	rect [ 165, 15, 140, 140,
		   transparent, <255 255 0> ]
	rect [ 315, 15, 140, 140,
		   transparent, <255 255 0> ]
	rect [ 465, 15, 140, 140,
		   transparent, <255 255 0> ]
	rect [ 615, 15, 140, 140,
		   transparent, <255 255 0> ]
	rect [ 765, 15, 140, 140,
		   transparent, <255 255 0> ]
		   
$End