$Sequence розыгрыш_типа : integer[1..3]
$Type = by_hist 123456789
$Body
	1	2	1
	2	3	1
	3	3	1
$End

$Function время_операции : integer[0..10]
$Type = table
$Parameters
	номер_операции: integer[1..3]
	номер_типа_детали: integer[1..3]
	номер_станка: integer[1..5]
$Body
	7	0	0
	8	0	0
	4	0	0

	0	8	0
	0	9	0
	0	9	0

	0	0	8
	0	0	9
	0	0	7

	7	7	7
	8	8	8
	8	8	7

	7	7	7
	8	8	8
	8	8	7
$End

$Function приоритет_операции : real
$Type = algorithmic
$Parameters
	тип_детали    : integer
	номер_операции: integer
$Body
	result = ( select(детали: детали.тип = тип_детали and детали.операция = (номер_операции - 1)).size() /
				(	select(детали: детали.тип = тип_детали and детали.операция = 0).size()
				  + select(детали: детали.тип = тип_детали and детали.операция = 1).size()
				  + select(детали: детали.тип = тип_детали and детали.операция = 2).size() ))
$End

$Function приоритет_типа_детали : real
$Type = algorithmic
$Parameters
	тип_детали    : integer
$Body
	if тип_детали = 1 result = (приоритет_1.значение / ( приоритет_1.значение + приоритет_2.значение + приоритет_3.значение ))
	if тип_детали = 2 result = (приоритет_2.значение / ( приоритет_1.значение + приоритет_2.значение + приоритет_3.значение ))
	if тип_детали = 3 result = (приоритет_3.значение / ( приоритет_1.значение + приоритет_2.значение + приоритет_3.значение ))
$End

$Function деталь_готова : real
$Type = algorithmic
$Parameters
	контейнер     : integer
	тип_детали    : integer
$Body
	if контейнер =  тип_детали result = 1
	if контейнер <> тип_детали result = 0
$End
